{
  "data": [
    {
      "id": "5180386d-8397-4245-9908-e9123b21a74c",
      "type": "Part Time",
      "url": "https://jobs.github.com/positions/5180386d-8397-4245-9908-e9123b21a74c",
      "created_at": "Fri May 15 13:00:34 UTC 2020",
      "company": "Daventry Solutions, LLC",
      "company_url": "http:",
      "location": "Remote",
      "title": "Full Stack Web/Javascript Developer",
      "description": "\u003cp\u003eUS CITIZENS ONLY\u003c/p\u003e\n\u003cp\u003eContractor position with possible option to come on as an employee after a 90 day period.\u003c/p\u003e\n\u003cp\u003eDuration: Approximately 3 months with opiton to come on full time.\u003c/p\u003e\n\u003cp\u003eHours Requirement: 20 hours minimum / 40 hours maximum\u003c/p\u003e\n\u003cp\u003ePay: $85 per hour\u003c/p\u003e\n\u003cp\u003eProject Description:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe client is building a compliance dashboard app for the automation of IT security procedures. The application feeds from the Forescout API (Security/Compliance platform).\u003c/li\u003e\n\u003cli\u003eThe application gathers vulnerability information and summarizes it using the type of device the vulnerability is on. The application also requires user input/configuration to answer Qualitative questions that are not machine-determinable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTechnical Info:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe application is written using Nuxt.JS / Vue.JS and is wrapped in an Electron container for running on a user's desktop.\u003c/li\u003e\n\u003cli\u003eIt will have a web server component (still to be developed) to maintain historical trends and other data using an Elasticsearch backend\u003c/li\u003e\n\u003cli\u003eStaging environment exists.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTasks and Deliverables:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe underpinnings of the app have already been developed, now it is a lot of tweaking, bug fixing, and feature development to meet all the needs.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJavaScript expert - Nuxt.JS or Vue.JS knowledge is a nice to have.\u003c/li\u003e\n\u003cli\u003eDocument-based data stores (Elasticsearch).\u003c/li\u003e\n\u003cli\u003eBe comfortable working with large datasets (1 million+ JSON documents).\u003c/li\u003e\n\u003cli\u003eNode.js\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOptional Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Forescout’s API\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eStack:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFrontend: JavaScript - Nuxt.JS and Vue.JS.\u003c/li\u003e\n\u003cli\u003eBackend: Node.js\u003c/li\u003e\n\u003cli\u003eStorage: Elasticsearch\u003c/li\u003e\n\u003cli\u003eInfrastructure: Local server\u003c/li\u003e\n\u003cli\u003eAPIs: Forescout API, Elasticsearch API\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEngagement Highlights:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVery interesting product in the IT's Security/Compliance space.\u003c/li\u003e\n\u003cli\u003eOpportunity to work with Forescout if you haven't yet!\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail resume to: \u003ca href=\"mailto:robert@davsol.net\"\u003erobert@davsol.net\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDZEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--acaa0775b8594628e32e9359a96fd6d77a2a0b3d/Daventry%20Solutions%20Logos%20-%20Red%20Feather2.png"
    },
    {
      "id": "1636261d-d10e-4c58-b54c-263dfe3225c6",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1636261d-d10e-4c58-b54c-263dfe3225c6",
      "created_at": "Wed May 13 09:01:47 UTC 2020",
      "company": "Politie",
      "company_url": "http:",
      "location": "Den Haag",
      "title": "backend medior developer",
      "description": "\u003cp\u003eEenheid Den Haag zoekt een doortastende backend developer voor het ontwikkelen van hoogwaardige applicaties voor een nieuw software development team Team Rendement Operationele Informatie. Dit nieuw op te zetten team gaat aan de slag met het ondersteunen van de operatie door het ontwikkelen van apps en tools. Het team gaat onder andere een grote rol spelen in het datagedreven opsporen van de toekomst. Ben jij die creatieve backend developer die een directe bijdrage wil leveren aan de handhaving van de rechtsorde en de veiligheid in de samenleving?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls backend developer versterk je het Team Rendement Operationele Informatie (TROI) van de Dienst Regionale Informatie Organisatie Den Haag (DRIO) en de Dienst Regionale Recherche (DRR). Samen met dit team bouw en onderhoud je informatiesystemen en ontwikkel je mee aan nieuwe tools. Dat betekent dat jij je bezighoudt met de volgende activiteiten:\u003c/p\u003e\n\u003cp\u003e·     ontwikkelen van back end systemen voor applicaties;\u003c/p\u003e\n\u003cp\u003e·     functionele APIs creëren;\u003c/p\u003e\n\u003cp\u003e·     cross-browser en adaptive HTML5 / CSS3 layout;\u003c/p\u003e\n\u003cp\u003e·     ontwerpen van service architectuur;\u003c/p\u003e\n\u003cp\u003e·     ontwikkelen van een applicatie platform;\u003c/p\u003e\n\u003cp\u003e·     design van user interfaces;\u003c/p\u003e\n\u003cp\u003e·     werken met coding architecture;\u003c/p\u003e\n\u003cp\u003e·     monitoren van server status.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls teamlid van TROI werk je samen met het Team Digitale Opsporing (TDO) en het team Business Intelligence en Kwaliteit (BI\u0026amp;K) in Den Haag. Het team houdt zich bezig met het genereren van de juiste informatie uit Big Data, brengt deze informatie samen en levert een bijdrage aan het komen tot tools, applicaties, voorspellingen en samenhang. Het team waar je komt te werken experimenteert met innovatieve methodieken. Samen met jouw collega's denk je buiten de bestaande kaders om te komen tot realistische en passende oplossingen. Veel talenten hebben een plek in dit soort teams gevonden. De ambities zijn groot en de spirit om goede tools te ontwikkelen is bij elke medewerker aanwezig. Het nieuw op te zetten team bestaat uit diverse specialisten, zoals data scientists, front- en back end developers, data analisten en andere data specialisten (zie ook de andere openstaande vacatures). Dit team wordt zorgvuldig op elkaar afgestemd, aan het eind van de selectieprocedure kijken we naar complementaire competenties.\u003c/p\u003e\n\u003cp\u003eHoewel de standplaats Voorburg is, wordt er van je verwacht dat je op diverse locaties werkzaam bent, waarvan het hoofdbureau op de Burgemeester Patijnlaan in Den Haag de meest voorkomende zal zijn. Het kan voorkomen dat je voor het werk moet reizen en eventueel voor langere periode op een andere locatie werkzaamheden verricht.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMet enthousiasme, leergierigheid en gedrevenheid zoek je altijd naar de beste en juiste oplossing. Je bent een initiatiefnemer, weet van aanpakken en werken met Agile/Scrum is wat je graag doet. Als backend developer beweeg jij je gemakkelijk door onze organisatie en stap je zonder moeite op collega's af om even te schakelen. Je bent communicatief vaardig waardoor je collega's mee kan nemen in jouw wereld maar ook kan doorvragen naar de behoeften van de teams.\u003c/p\u003e\n\u003cp\u003eVerder vragen wij:\u003c/p\u003e\n\u003cp\u003e·     een afgeronde hbo opleiding ICT;\u003c/p\u003e\n\u003cp\u003e·     minimaal een jaar werkervaring als bijvoorbeeld (junior) backend developer. Het liefst opgedaan bij een grote organisatie waar softwareontwikkeling met meerdere teams wordt gerealiseerd;\u003c/p\u003e\n\u003cp\u003e·     goede mondelinge en schriftelijke uitdrukkingsvaardigheid in zowel de Nederlandse als Engelse taal;\u003c/p\u003e\n\u003cp\u003e·     ervaring met Agile/Scrum;\u003c/p\u003e\n\u003cp\u003e·     aantoonbare relevante werkervaring met bijvoorbeeld: Java, PHP, Python, C#, C++, Ruby, Node JS, GlassFish en/of Tomcat, opslag van gegevens binnen database architectuur zoals (ElasticSearch, Express en Mongo DB's e.d.), Version Control/Git, Testing/Debugging en basis HTML/CSS is een pre.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDe standplaats is Den Haag. Er is ruimte voor 1 fte. Het betreft een functie voor 36 uur per week.\u003c/p\u003e\n\u003cp\u003eOm deze functie goed uit te kunnen voeren volg je aan de Politieacademie de opleiding voor specifieke inzetbaarheid met eventueel aansluitend een voor de functie benodigd aanvullend opleidingsprogramma.\u003c/p\u003e\n\u003cp\u003eTijdens deze verkorte politieopleiding word je tijdelijk aangesteld als ambtenaar in opleiding. Na het voltooien van de opleiding bieden we je een tijdelijke aanstelling aan, waarbij een proeftijd van één jaar van toepassing is. Na deze proeftijd volgt zo snel mogelijk een vaste aanstelling.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cp\u003e·     een bruto maandsalaris van minimaal € 2.790,- en maximaal € 4.502,- (schaal 10 Bbp) op basis van een 36-urige werkweek;\u003c/p\u003e\n\u003cp\u003e·     8% vakantie- en 8.33% eindejaarsuitkering;\u003c/p\u003e\n\u003cp\u003e·     goede pensioenregeling en betaald ouderschapsverlof (meer info over verlof, regelingen en mogelijkheden).\u003c/p\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is operationeel specialist B, werkterrein digitale expertise.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInteresse?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBel of mail met Dominique Bol, teamchef BI \u0026amp; Kwaliteit (06 - 15 30 92 36, \u003ca href=\"mailto:dominique.bol@politie.nl\"\u003edominique.bol@politie.nl\u003c/a\u003e) als je meer informatie over de functie wilt hebben.\u003c/p\u003e\n\u003cp\u003eVoor vragen over de sollicitatieprocedure bel of mail je met Ostar Roozenbeek, recruiter Cyber (06 - 47 65 91 71, \u003ca href=\"mailto:ostar.roozenbeek@politie.nl\"\u003eostar.roozenbeek@politie.nl\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 25 mei 2020 via de \u003cstrong\u003esollicitatie\u003c/strong\u003e button.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e·     Een veiligheidsonderzoek en een assessment maken deel uit van de selectieprocedure.\u003c/p\u003e\n\u003cp\u003e·     Je hebt de Nederlandse nationaliteit (dit mag ook je tweede nationaliteit zijn).\u003c/p\u003e\n\u003cp\u003e·     Zonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime Challenge op \u003ca href=\"http://it.kombijdepolitie.nl/\"\u003ehttp://it.kombijdepolitie.nl/\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e·     De politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eKlik hier om te solliciteren: \u003ca href=\"https://vonq.io/3fKYiPa\"\u003ehttps://vonq.io/3fKYiPa\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df6511efd07117305e140a5e23181c3f9a06875f/Politie%20logo.jpg"
    },
    {
      "id": "24e946fa-c05f-4ab4-b10c-024a8532cf9c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/24e946fa-c05f-4ab4-b10c-024a8532cf9c",
      "created_at": "Tue May 12 10:59:24 UTC 2020",
      "company": "Cryptohopper",
      "company_url": "https://www.cryptohopper.com",
      "location": "Amsterdam, the Netherlands.",
      "title": "Full stack (lead) Developer (Senior)",
      "description": "\u003cp\u003eCryptohopper is searching for an extremely talented full-stack developer that has the potential of becoming the lead developer. Do you like (extreme) challenges? Are you entrepreneurial? Do you have lots of experience? And are you ready to change the way the world is trading? Then come and join team Cryptohopper.\u003c/p\u003e\n\u003cp\u003eCryptohopper?\u003c/p\u003e\n\u003cp\u003eCryptohopper is a fast-growing scaleup, based in Amsterdam. We have developed an advanced trading platform that specializes in auto-trading cryptocurrencies. Our platform runs in the cloud and trades our users' coins on their favorite exchanges 24/7.\u003c/p\u003e\n\u003cp\u003eAs a developer, you will have the responsibility of maintaining and enhancing the platform as well as developing applications and new technical trading features. You will contribute to our corporate mission of providing the world-leading solution for learning, sharing, optimizing, and implementing successful cryptocurrency trading to anyone.\u003c/p\u003e\n\u003cp\u003eAccording to Techleap, Cryptohopper is among the top 5 best-performing startups in the Netherlands. Techleap was founded by HRH Prince Constantijn of the Netherlands, who likewise personally supports the mission of Cryptohopper. We are also already a widely established player in the trading bot marketplace with over 190’000 global users.\u003c/p\u003e\n\u003cp\u003eWho are we and what do we offer?\u003c/p\u003e\n\u003cp\u003eOur HQ is located in the vibrant city of Amsterdam. So far, we’ve got a team of 22 young entrepreneurs, each with entirely diverse academic backgrounds ranging from computer sciences to management, economics, history, and philosophy. Our CTO is an incredible developer, and you’ll have the ability to work side by side, bounce ideas off him, and of course, learn a lot.\u003c/p\u003e\n\u003cp\u003eLife at Cryptohopper\u003c/p\u003e\n\u003cp\u003eAt Cryptohopper, we strongly believe that the creativity of our team stands at the core of our ability to innovate and build the best automated trading platform in the world. That’s why we encourage your professional freedom, so that you can best apply your unique skill-set in the role. We do not only offer internal development and external training, but also give you an exciting opportunity to kickstart your career in the field of cryptocurrencies and investing. You will therefore also quickly become versed in the investment strategies of professional crypto traders.\u003c/p\u003e\n\u003cp\u003eOur office has plenty of space, so you can make your workspace as suitable as possible to shine as a developer, while playing games of Ping-Pong during breaks in our company men cave.\u003c/p\u003e\n\u003cp\u003eWho are you?\u003c/p\u003e\n\u003cp\u003eForemost, we're searching for someone that lives or is willing to relocate to the Netherlands. While, we do not strictly require a demonstrated interest in the financial industry, cryptocurrencies, trading or blockchain, these attributes are an advantage and will facilitate your impact with us.\u003c/p\u003e\n\u003cp\u003eYou are an entrepreneurial and hard-working person who likes to learn. You like challenges and have built many websites/products by yourself before. You're a developer's Jack of all Trades and want to have an impact on a product, as opposed to working in a corporate and not having much impact.\u003c/p\u003e\n\u003cp\u003eYour day will consist of perfecting our platform and discussing and implementing innovative ideas that will improve Cryptohopper. You will have a front-row seat in developing a program at the forefront of cryptocurrency innovation, that is set to revolutionalize how private investors trade their digital assets.\u003c/p\u003e\n\u003cp\u003ePrerequisite skills:\u003c/p\u003e\n\u003cp\u003eMySQL\nPHP\njQuery\nNode Js\nLinux\nShell\nAmazon Webservices\nJoomla\u003c/p\u003e\n\u003cp\u003eSuccessful applicants are invited for interviews. Please note, that we only accept applications from individuals. Not agencies/companies. Please send your resume and letter of motivation at \u003ca href=\"https://cryptohopper.freshteam.com/jobs/_DYO7bOKfIlF/full-stack-lead-developer-senior\"\u003ehttps://cryptohopper.freshteam.com/jobs/_DYO7bOKfIlF/full-stack-lead-developer-senior\u003c/a\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease go to \u003ca href=\"https://cryptohopper.freshteam.com/jobs/_DYO7bOKfIlF/full-stack-lead-developer-senior\"\u003ehttps://cryptohopper.freshteam.com/jobs/_DYO7bOKfIlF/full-stack-lead-developer-senior\u003c/a\u003e and send your resume and motivation letter. Please note, that we only accept applications from individuals. Not agencies/companies.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUdEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3376f620c4ff238a06e5cc264fb8ce7562fe258f/RGB_logo_darknavy-01.png"
    },
    {
      "id": "f860e218-92f7-4268-b640-1b59528b6490",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/f860e218-92f7-4268-b640-1b59528b6490",
      "created_at": "Tue May 12 00:31:57 UTC 2020",
      "company": "Clarity Movement Co.",
      "company_url": "http://www.clarity.io",
      "location": "Remote",
      "title": "Software Tech Lead",
      "description": "\u003cp\u003e\u003cstrong\u003ePlease apply by completing this\u003c/strong\u003e \u003ca href=\"https://airtable.com/shrzLJaA5te3s2eey?prefill_Applying%20for=Software%20Lead\u0026amp;prefill_Source=GitHub\"\u003eform\u003c/a\u003e. Applications submitted without a cover letter will not be considered. Please give examples that showcase the required skills identified in this job description.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePosition Overview\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClarity, a Series A clean-tech startup, is looking for an experienced full-stack tech lead to spearhead our software team and join the mission of bringing clear air to the world. He or she will drive the technical evolution of our IoT sensor data pipeline, customer-facing web applications, and data analysis tools. Clarity is a globally distributed organization with headquarters in Oakland, CA.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Company\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Clarity, we strive to empower the world to reduce air pollution. We do that by making it accessible for cities and industries to measure and understand their air pollution issues and take effective action.\u003c/p\u003e\n\u003cp\u003eToday, when cities and industrial facilities want to measure air quality at a site they have to purchase expensive monitoring equipment and invest even more to install it in container-sized shelters and integrate its measurements into their IT system. This is unacceptable because it leads to the inability to monitor air pollution at important sites and ultimately to the inability to manage air pollution.\u003c/p\u003e\n\u003cp\u003eWe envision a world where novel sensing technology, IoT and cloud computing simplify air quality measurement, enabling cities and industrial facilities to scale up the number of monitoring sites and take data-driven action.\u003c/p\u003e\n\u003cp\u003eOur Sensing-as-a-Service solution for air quality is currently deployed in over 70 cities across 30+ countries and is changing how municipalities and industrial facilities monitor their air quality.\u003c/p\u003e\n\u003cp\u003eAfter successfully raising our Series A (a few words from our investors \u003ca href=\"https://www.ramanan.com/personal-blog/amasias-investment-in-clarity-movement\"\u003ehere\u003c/a\u003e and \u003ca href=\"https://medium.com/speroventures/the-air-we-breathe-c52094aa2f46\"\u003ehere\u003c/a\u003e), we are excited to keep building on our current success elevating our product to the next level, at the forefront of the clean air movement. This is especially true of our software products, where we see a significant opportunity to increase the value we provide to our customers as well as to expand the number of use cases supported by our Sensing-as-a-Service solution.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Team\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a diverse group of engineers, scientists, and makers from all around the world who are passionate about what we do and devoted to our mission to improve the world by solving some of its greatest challenges.\u003c/p\u003e\n\u003cp\u003eWe believe in solving challenging problems by adopting a growth mindset, by fostering an environment that encourages deep collaboration, empathy, and creativity, and by keeping a good sense of humor. We enjoy philosophical debates as much as nerding out about the soldering talents of our HW engineers or the cool data visualizations we create.\u003c/p\u003e\n\u003cp\u003eAlthough we always have our mission in mind, we know the path for any startup has ups and downs and we’re more than happy to face them together as a team. How else could you tackle a problem as complex and global as air pollution?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are seeking a highly self-motivated and passionate full-stack developer with a proven leadership track record to bring our Clarity Cloud to the next level. We expect you to begin by working 70% on development and 30% on leading and mentoring our software engineers (3 full-time developers at the moment), setting technical direction and curating an Agile delivery process. As the number of team members increases, we expect you to gradually increase the amount of time spent on directing the team.\u003c/p\u003e\n\u003cp\u003eOn the development side, you will work on:\u003c/p\u003e\n\u003cp\u003eConstantly improving the performance, scalability, and reliability of our system given the growing size of our sensor networks\nDeveloping new services, architecture, and technology to enable new use cases for our sensing-as-a-service solution\nDeveloping new web applications to deliver value and insight from monitoring data to our customers\nOn the leadership side, you will:\u003c/p\u003e\n\u003cp\u003eHelp to shape Clarity’s software product vision by interacting with the hardware and customer success teams\nSupport product management in identifying and prioritizing high value initiatives\nBe in charge of defining an efficient software production process for enabling the software team to work the backlog and deliver new treats to our customers in a cadenced and timely manner.\nOur product is multidisciplinary, ranging from ubiquitous IoT hardware to scalable data pipelines, advanced data quality assurance algorithms and insightful data analyses. You will enjoy freedom of action around these topics and be encouraged to take initiative for making our software offerings truly revolutionary in the clean-tech space.\u003c/p\u003e\n\u003cp\u003eYou will have plenty of opportunity to work closely with our customers and end-users who hail from industry, government, NGOs, community groups, and academia. At the same time you will be working closely with our CTO and executive team to help guide Clarity to success.\u003c/p\u003e\n\u003cp\u003eWe believe Clarity could be the right place for you to join the fight to environmental issues around the world by leveraging your software superpowers!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e5+ years of experience in shipping production software for the cloud\n1+ years of experience in leading a team\nExperience in working in an Agile software team\nBack End development experience, preferably with Python, Node.js, Kafka, and MongoDB\nExperience in working with AWS serverless services, such as Lambda, Kinesis, DynamoDB, ECS, and API Gateway\nExperience in working with CI/CD tools, such as Travis CI\nFront End development experience with React.js or similar frameworks\nGood visual skills and knowledge of UI/UX general principles is a plus\nExperience working remotely or as part of a geographically distributed team\nMission-Driven: You feel a deep desire for your work to have a positive impact on society and the environment, and this motivates you to deliver great results.\nFlexible: You are comfortable to work with a small and nimble team, limited resources, light structure and evolving requirements. You are ready to burn the midnight oil when needed.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease apply by completing this \u003ca href=\"https://airtable.com/shrzLJaA5te3s2eey?prefill_Applying%20for=Software%20Lead\u0026amp;prefill_Source=GitHub\"\u003eform\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f765327a98fc5653616f7b09716d35f7d2dc81cf/Clarity_logo_color.png"
    },
    {
      "id": "4a6a239b-f76c-48cf-b5e1-bb2ac44c33c3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4a6a239b-f76c-48cf-b5e1-bb2ac44c33c3",
      "created_at": "Mon May 11 17:12:18 UTC 2020",
      "company": "Flourish",
      "company_url": "https://flourish.studio",
      "location": "London or Remote (UK)",
      "title": "Senior Developer",
      "description": "\u003cp\u003e\u003cstrong\u003eClosing date\u003c/strong\u003e: 9am BST Monday 18 May 2020\n\u003cstrong\u003eInterviews\u003c/strong\u003e: Week beginning 25 May 2020 (remotely)\u003c/p\u003e\n\u003cp\u003eDo you love modern web technologies? Are you a team player who likes solving problems? Do you want to join one of the UK's hottest tech start-ups and be part of a talented and friendly team?\u003c/p\u003e\n\u003cp\u003eFlourish is an online tool for creating beautiful data graphics, presentations and other interactive content without coding. Launched in 2018, we have grown quickly and are used by some of the world’s largest companies, including EY, Goldman Sachs and Moody’s.\u003c/p\u003e\n\u003cp\u003eIn partnership with Google News Lab, we also work with many of the world’s leading news organizations, including the BBC, Sky and Financial Times.\u003c/p\u003e\n\u003cp\u003eWe’re looking for a senior developer to join our team, reporting to the head of software development.\u003c/p\u003e\n\n\u003ch2\u003eThe role\u003c/h2\u003e\n\u003cp\u003eYou’ll be working on:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloping new features for Flourish, using modern web technologies\u003c/li\u003e\n\u003cli\u003eMaintaining standards for web performance, security and accessibility\u003c/li\u003e\n\u003cli\u003eBuilding automated tests and improving the observability of the codebase\u003c/li\u003e\n\u003cli\u003eMentoring and supporting more junior developers\u003c/li\u003e\n\u003cli\u003ePairing and reviewing code\u003c/li\u003e\n\u003cli\u003eHelping improve the way we work and the tools we use.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis role is focused on the Flourish back-end platform rather than the visualization templates, which are developed separately.\u003c/p\u003e\n\u003ch2\u003eAbout you\u003c/h2\u003e\n\u003cp\u003eYou are a keen developer who enjoys working collaboratively and loves to learn new things. You care deeply about the quality of your work, and are thoughtful about how to improve both what you’re doing and how the team works together. You’re happy to adopt existing conventions of the code base.\u003c/p\u003e\n\u003cp\u003eImportantly, you’re excited by Flourish and the opportunity to make it better. You’re a friendly colleague and you work well in a close-knit team.\u003c/p\u003e\n\u003cp\u003eWe’re interested in people who have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in back-end development, with knowledge of JavaScript\u003c/li\u003e\n\u003cli\u003eA good understanding of the web platform\u003c/li\u003e\n\u003cli\u003eFamiliarity with working practices such as test-driven development, continuous integration and continuous delivery\u003c/li\u003e\n\u003cli\u003eExperience of agile environments and version control\u003c/li\u003e\n\u003cli\u003eAn enthusiasm for learning and teaching\u003c/li\u003e\n\u003cli\u003eA systematic approach to solving problems\u003c/li\u003e\n\u003cli\u003eA love of the web and an interest in performance\u003c/li\u003e\n\u003cli\u003eExperience in leadership - helping colleagues with career development, mentoring more junior staff members\u003c/li\u003e\n\u003cli\u003eThe ability to give feedback kindly and receive feedback.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAbout us\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eOur tech stack\u003c/strong\u003e: Some of the technologies we use include Node.js, Express; Postgres, Redis; Handlebars, Sass; AWS; Cypress; GitHub, CircleCI, Sentry. We don’t expect you to have worked with all of these, but any you have are a plus.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eOur company\u003c/strong\u003e: Flourish is a small team combining decades of collective experience in development, data, design, visualization and journalism/publishing. \u003ca href=\"https://flourish.studio/company\"\u003eRead more about the team\u003c/a\u003e.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eOur culture\u003c/strong\u003e: We’re a friendly and supportive group that values kindness, honesty and fun. We’re open and try new things with enthusiasm. And we’re high-momentum, focused on delivering magical products that our users love. We socialise as a team at least once a month.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eOur interview process\u003c/strong\u003e: We designed our interview process to be rigorous, but friendly and collaborative. We’ll ask you to do some pairing with us, to get a sense for how you communicate, but we don’t do stressful whiteboard coding. We also don't do lengthy take-home exercises, though depending on the number of applications, we may do a short online pre-screening test.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eOur approach\u003c/strong\u003e: We’re committed to equality and diversity in the tech industry, so we’ll be especially happy to see applications from under-represented backgrounds.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSalary from £60k-75k depending on experience.\u003c/li\u003e\n\u003cli\u003eRemote working is welcome (the majority of our development team is remote), though after lockdown lifts, we’d want you to be in London at least every few weeks for our sprint planning and retros.\u003c/li\u003e\n\u003cli\u003e‘20% time’ for developers on Fridays - you can choose what to work on, as long as it’s relevant to the company’s mission.\u003c/li\u003e\n\u003cli\u003eShare options in a rapidly growing company.\u003c/li\u003e\n\u003cli\u003eFlexible hours, and respect for work/life balance.\u003c/li\u003e\n\u003cli\u003e30 days’ annual holiday.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eNot right for you?\u003c/h2\u003e\n\u003cp\u003ePlease spread the word instead! And \u003ca href=\"/newsletter\"\u003ejoin our mailing list\u003c/a\u003e to stay posted about Flourish.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eSend a CV, and a covering letter explaining why you're interested in this role and how you meet the description above, to \u003ca href=\"mailto:jobs@kiln.digital\"\u003ejobs@kiln.digital\u003c/a\u003e. Please use the subject line “Senior Developer”. Got questions about the job? Feel free to email us for a chat.\u003c/p\u003e\n\u003cp\u003eSorry, but we won’t be able to sponsor visas for this role: please do not apply if you do not already have the right to work in the UK. We are not accepting applications from recruitment agencies for this role.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2c038f0941bf34e88b67a9ccf1763fa732785dac/flourish-logo-big.jpeg"
    },
    {
      "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
      "created_at": "Sat Aug 03 00:50:23 UTC 2019",
      "company": "Game Closure",
      "company_url": "http://gameclosure.com",
      "location": "San Francisco, Mountain View, Tokyo, Remote",
      "title": "Senior Game Engineer (REMOTE)",
      "description": "\u003cp\u003eGAME CLOSURE\u003c/p\u003e\n\u003cp\u003eSan Francisco, Mountain View, Tokyo, Remote  -  Full Time\u003c/p\u003e\n\u003cp\u003eGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user!\u003c/li\u003e\n\u003cli\u003eInsist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eProficient at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with analytics and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003cli\u003eUnderstanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003cli\u003eExpert knowledge of TypeScript\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGC Perks:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Dental, \u0026amp; Vision: Top quality insurance options with 100% of premiums covered\u003c/li\u003e\n\u003cli\u003eSocial Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\u003c/li\u003e\n\u003cli\u003eCommuter Pass + Free Parking: Your commute and parking to the office is on us!\u003c/li\u003e\n\u003cli\u003ePTO: Unlimited vacation policy\u003c/li\u003e\n\u003cli\u003eMeals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\u003c/li\u003e\n\u003cli\u003ePet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"
    },
    {
      "id": "7a193471-9e59-46a5-9c7b-3f62f185750b",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/7a193471-9e59-46a5-9c7b-3f62f185750b",
      "created_at": "Thu Apr 30 20:30:25 UTC 2020",
      "company": "Oregon State University - Ecampus",
      "company_url": "https://ecampus.oregonstate.edu/",
      "location": "Corvallis, OR",
      "title": "Analyst Programmer / Web Developer",
      "description": "\u003cp\u003eThis recruitment will be used to fill one full-time Analyst Programmer, competency level 2, position for Ecampus at Oregon State University (OSU).\u003c/p\u003e\n\u003cp\u003eThis is a limited duration classified position anticipated to last 18 months.\u003c/p\u003e\n\u003cp\u003eOregon State University Ecampus is a growing, innovative and collaborative organization with a commitment to providing high-quality online degrees and programs. OSU Ecampus makes OSU’s exceptional learning experiences available to students throughout Oregon and around the world.\u003c/p\u003e\n\u003cp\u003eThe front-end web developer (analyst programmer, competency level 2) is a classified position within OSU Ecampus. The front-end web developer provides programming and multimedia support for OSU Ecampus programmatic and course needs. The multimedia team is part of the Course Development and Training (CDT) unit within the division of Ecampus. The CDT unit provides expertise and support for the development of online and hybrid courses, including instructional design services, innovative multimedia development, and faculty development programming and support. This position reports directly to the assistant director of CDT.\u003c/p\u003e\n\u003cp\u003eWithin the CDT team, the front-end web developer will collaborate closely with other programmers on the multimedia web development team, instructional designers and faculty course developers to ensure high quality projects are produced. This position works closely and collaborates with faculty and administrators to assess how multimedia technologies can augment students’ abilities to meet course learning outcomes.\u003c/p\u003e\n\u003cp\u003eOregon State University and the division of Ecampus maintain and enhance a collaborative and inclusive community that is dedicated to equity and equal opportunity. All employees of the division are responsible for ensuring that these commitments are achieved. This position directly contributes to those goals by designing learning environments that are inclusive, accessible, and follow the best practices of Universal Design for Learning.\u003c/p\u003e\n\u003cp\u003ePosition Duties\n75% Application Design \u0026amp; Development\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesigns, develops and maintains scalable applications created in modern web technologies (primarily, but not limited to React, Redux, CSS3, HTML5 and Javascript) to meet the expectations and needs of OSU Ecampus clients/users.\u003c/li\u003e\n\u003cli\u003eDevelop front-end projects and components using modern web languages and patterns. Responds to cross-platform/browser compatibility issues. Develops applications with adaptive/responsive design, paying attention to mobile accessibility, end-user accessibility, and web standards.\u003c/li\u003e\n\u003cli\u003eWorks as a member of the web development team to design and implement solutions to solve complex problems in Javascript applications used for online courses.\u003c/li\u003e\n\u003cli\u003eDesigns and develops scripts with scalability and reusability in mind.\u003c/li\u003e\n\u003cli\u003eResponsible for designing, writing and implementing testing processes (automated and non-automated).\u003c/li\u003e\n\u003cli\u003eResponsible for documentation of any scripts, functions, tools, or integrations developed.\u003c/li\u003e\n\u003cli\u003eReviews web applications and modules that have been developed for online courses with content experts and CDT team members involved in the project.\n10% Research and Assessment\u003c/li\u003e\n\u003cli\u003eResearches and develops methods and technology that leverage media in improving instruction, knowledge transfer, and learner retention of information.\u003c/li\u003e\n\u003cli\u003eIdentifies emerging technologies and resources that can be used to enhance and improve the quality and completion rate of media projects.\u003c/li\u003e\n\u003cli\u003eAssesses and evaluates the effectiveness of technological components and products. Researches and suggests improvements to current processes and tools.\n10% Troubleshooting and Support\u003c/li\u003e\n\u003cli\u003eTroubleshoots web applications to resolve issues and diagnose technical problems that affect the work of OSU Ecampus’ clients/users.\u003c/li\u003e\n\u003cli\u003eAssists with troubleshooting problems for end-users.\n5% Professional Development and Service\u003c/li\u003e\n\u003cli\u003eServes as a member of OSU Ecampus teams as assigned. Provides service to OSU and the land grant system by working on departmental, division, university, regional and national committees and projects, serving as a representative of OSU Ecampus and the CDT team.\u003c/li\u003e\n\u003cli\u003eParticipates as a member of the CDT team by attending meetings, participating in team decision making, implementing solutions to team challenges as a member of the multimedia team, and assisting with other team functions. Service may include other duties as assigned to support and provide back up the CDT team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMinimum Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis classification requires a basic foundation of knowledge and skills in systems analysis and related programming support functions generally obtained by a bachelor’s degree in computer science, or an equivalent amount of training and applied experience.\u003c/li\u003e\n\u003cli\u003eDemonstrated skill in Javascript\u003c/li\u003e\n\u003cli\u003eExcellent written and oral communication skills\u003c/li\u003e\n\u003cli\u003eExperience developing in a collaborative team environment\u003c/li\u003e\n\u003cli\u003eA demonstrable commitment to promoting and enhancing diversity\u003c/li\u003e\n\u003cli\u003eThis position is designated as a critical or security-sensitive position; therefore, the incumbent must successfully complete a criminal history check and be determined to be position qualified as per OSU Standard 576-055-0000 et seq. Incumbents are required to self-report convictions and those in youth programs may have additional criminal history checks every 24 months.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience working with React and Redux\u003c/li\u003e\n\u003cli\u003eExperience with source control / version control systems (such as Git)\u003c/li\u003e\n\u003cli\u003eExperience working with Node.js as a backend language\u003c/li\u003e\n\u003cli\u003eExperience with Serverless/AWS (Amazon Web Services)\u003c/li\u003e\n\u003cli\u003eExperience with dependency and task management (npm, yarn)\u003c/li\u003e\n\u003cli\u003eExperience with mobile accessibility and responsive design\u003c/li\u003e\n\u003cli\u003eExperience integrating with APIs (REST)\u003c/li\u003e\n\u003cli\u003eExperience with universal design for learning.\u003c/li\u003e\n\u003cli\u003eExperience with Agile (scrum, kanban)\u003c/li\u003e\n\u003cli\u003eExperience working with a diverse group of people/teams.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOSU is committed to a culture of civility, respect, and inclusivity.  As an Affirmative Action/Equal Opportunity employer, OSU values diversity in our faculty and staff regardless of their self-identity; to that end, we particularly encourage applications from members of historically underrepresented racial/ethnic groups, individuals with disabilities, veterans, women, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community. \u003c/p\u003e\n\u003cp\u003eApplication deadline: May 20th, 2020\nFor more information and to apply go to \u003ca href=\"http://jobs.oregonstate.edu/postings/90989\"\u003ehttp://jobs.oregonstate.edu/postings/90989\u003c/a\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApplication deadline: May 20th, 2020\u003c/p\u003e\n\u003cp\u003eFor more information and to apply go to \u003ca href=\"http://jobs.oregonstate.edu/postings/90989\"\u003ehttp://jobs.oregonstate.edu/postings/90989\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a632d2149b760e8cab2f5ab3e173bab5e6b45bb/OrangeSocialAvatar.png"
    },
    {
      "id": "010f8467-ceb4-421f-9262-4dc8521644ce",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/010f8467-ceb4-421f-9262-4dc8521644ce",
      "created_at": "Fri Apr 24 20:44:12 UTC 2020",
      "company": "Citizens Bank",
      "company_url": "https://www.citizensbank.com/",
      "location": "Johnston, RI",
      "title": "Platform Engineer",
      "description": "\u003cp\u003eWe are looking for a Digital Site Reliability Engineering Leader (Platform Engineer) that will drive a team that transforms the way Citizens Bank implements, deploys, supports and operates our digital platform. The focus is on enabling engineering teams with expert guidance and tools to deliver frequent, high quality and reliable components as part of our digital platform. This role would also set strategy and lead our evolution to a continuous delivery world.\u003c/p\u003e\n\u003cp\u003eThis person would also manage, guide and educate a fixed and a rotating group of platform developers on security, automation, and cloud architecture/technology. This person will work closely with security, Infrastructure, Risk, Middleware, and other areas of the company to ensure continuous delivery and DevOps are influenced throughout the value chain.\u003c/p\u003e\n\u003cp\u003ePrimary responsibilities include:\u003c/p\u003e\n\u003cp\u003eSoftware Delivery\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to application code base and architecture with a focus on optimization for performance, reliability, scalability, security and cost\u003c/li\u003e\n\u003cli\u003eDevelop and implement solutions for non-functional requirements using with a focus on broad re-use across system components\u003c/li\u003e\n\u003cli\u003eImplement CI/CD best practices, deployment pipelines and test automation frameworks to enable frequent, high quality releases\u003c/li\u003e\n\u003cli\u003eDefine and implement application deployment strategy based on application type\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOperations\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGuide, grow and train agile engineering teams to optimize service quality and ensure adoption of operational best practices\u003c/li\u003e\n\u003cli\u003eEnsure the effective capture of application telemetry, logging and monitoring of all aspects of system and application behavior to facilitate fast detection and resolution of issues\u003c/li\u003e\n\u003cli\u003eDesign and develop operational tools and services needed to effectively operate system components\u003c/li\u003e\n\u003cli\u003eUnderstanding and adherence to operational processes ensuring audit-ability, risk and compliance with ISO and industry standards (includes Incident, Problem and Change Management)\u003c/li\u003e\n\u003cli\u003eContinually evaluate service and infrastructure usage to effectively manage performance, capacity and cost – automating solutions wherever possible\u003c/li\u003e\n\u003cli\u003eParticipate as a member of the SRE community to develop tools and services that enable automated operations\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSupport\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to documentation required to guide on-call engineers and on-board team members\u003c/li\u003e\n\u003cli\u003eMaintain system wide health and proactively seek out potential issues, address with component teams\u003c/li\u003e\n\u003cli\u003eProactively and continuously drive system wide quality improvements by undertaking thorough root cause analysis for major incidents with component engineering teams\u003c/li\u003e\n\u003cli\u003eProvide training and coaching in a capacity as Subject Matter Expert to other engineers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003eRequired Skills/Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRequired experience in a continuous delivery model similar role at an organization that has adopted the SRE model\u003c/li\u003e\n\u003cli\u003eBackground in production operations and support at scale with a proven track record of maintaining highly available and performant platforms\u003c/li\u003e\n\u003cli\u003eExperienced in programming and scripting languages to contribute to application development and automation (e.g., Java, Node.js Python)\u003c/li\u003e\n\u003cli\u003eExperienced in AWS Cloud formation and Hashicorp Terraform\u003c/li\u003e\n\u003cli\u003eSome practical knowledge of container solutions (e.g., Docker, Kubernetes,)\u003c/li\u003e\n\u003cli\u003eExperience with source Control Systems (e.g., GIT/Gerrit)\u003c/li\u003e\n\u003cli\u003eExperience with tools and platforms like (e.g., Jenkins, Maven, Nexus)\u003c/li\u003e\n\u003cli\u003eUsage of test frameworks like (e.g., JMeter, Cucumber, Selenium)\u003c/li\u003e\n\u003cli\u003eHands on working knowledge of deployment pipelines for languages like (e.g., Node.js, Java, Springboot)\u003c/li\u003e\n\u003cli\u003eSecurity best practices (SSH, Certificate management, or standards such as PCI)\u003c/li\u003e\n\u003cli\u003eExcellent debugging / problem solving skills including ability to investigate and remedy software bugs if necessary\u003c/li\u003e\n\u003cli\u003ePreferably experienced with Infrastructure as a Service/Cloud computing (e.g., Amazon AWS, Google Compute Engine, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation, Certifications and/or Other Professional Credentials:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHours \u0026amp; Work Schedule\u003c/p\u003e\n\u003cp\u003eHours per Week:  40\nWork Schedule:  M-F\u003c/p\u003e\n\u003cp\u003eWhy Work for Us\u003c/p\u003e\n\u003cp\u003eAt Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth.\u003c/p\u003e\n\u003cp\u003eEqual Employment Opportunity\u003c/p\u003e\n\u003cp\u003eIt is the policy of Citizens Bank to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to race, color, ethnicity, religion, gender, pregnancy/childbirth, age, national origin, sexual orientation, gender identity or expression, disability or perceived disability, genetic information, citizenship, veteran or military status, marital or domestic partner status, or any other category protected by federal, state and/or local laws.\u003c/p\u003e\n\u003cp\u003eEqual Employment and Opportunity Employer/Disabled/Veteran\u003c/p\u003e\n\u003cp\u003eCitizens Bank is a brand name of Citizens Bank, N.A. and each of its respective subsidiaries.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply at \u003ca href=\"https://jobs.citizensbank.com/job/johnston/platform-engineer/288/16034631\"\u003ehttps://jobs.citizensbank.com/job/johnston/platform-engineer/288/16034631\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXlDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--844398340e68d429e675880c6588b46fc33c05b3/Citizens%20Bank%20logo-16735-18280.png"
    },
    {
      "id": "a6ec7302-239b-4149-be8c-8817509c827e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/a6ec7302-239b-4149-be8c-8817509c827e",
      "created_at": "Mon Apr 20 12:49:10 UTC 2020",
      "company": "PwC",
      "company_url": "http:",
      "location": "Amsterdam",
      "title": "Front End Developer",
      "description": "\u003ch2\u003eWelcome to PwC’s Experience Center\u003c/h2\u003e\n\u003cp\u003eAs part of an international community of creators, makers and innovators you drive the business of PwC’s digital services from our Experience Center. In cross-functional teams, you design and build innovative solutions for our clients to thrive in the ‘experience age’.\u003c/p\u003e\n\u003cp\u003eMany of our clients face significant challenges - expectations of their customers and employees change faster than they can adapt. At the same time, new market entrants cause significant disruption, and steal market share away. To tackle these challenges, our clients require a partner that can help them innovate and accelerate the implementation of solutions that have an immediate and differentiating impact on the experience provided to their customer or employees.\u003c/p\u003e\n\u003cp\u003eThe Experience Center is part of a multinational European team, closely collaborating with colleagues across offices in Amsterdam, Brussels, Paris, Frankfurt, Berlin and Stockholm to name a few.\u003c/p\u003e\n\u003cp\u003eFor more information about the Experience Center take a look on the following page.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eWho are you?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eTo have a differentiating impact on our clients’ customers and their employees, you will be user-centric in your thinking and approach. You are passionate about designing delightful experiences for humans, to empower and enable them.\u003c/p\u003e\n\u003cp\u003eYou know how to effectively work in cross-functional, agile teams. You are a digital native, creative in everything you do, you are confident, and you dare to challenge the status quo.\u003c/p\u003e\n\u003cp\u003eWe would love to hear from you if you meet most of the following expectations:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have multiple years of experience in software development and you love to code;\u003c/li\u003e\n\u003cli\u003eYou’ve been doing responsive web development for years and have an eye for great UI / UX design;\u003c/li\u003e\n\u003cli\u003eYou have a lot of experience working with frontend technologies like HTML, CSS and JavaScript;\u003c/li\u003e\n\u003cli\u003eYou have worked with CSS preprocessors like Sass/SCSS and understand CSS naming conventions;\u003c/li\u003e\n\u003cli\u003eYou work with modern frontend tools and follow industry standard best practices;\u003c/li\u003e\n\u003cli\u003eYou have knowledge programming using modern JavaScript/ES and frameworks like React;\u003c/li\u003e\n\u003cli\u003eYou are comfortable working within a node.js environment;\u003c/li\u003e\n\u003cli\u003eYou have managed code repositories using Git version control;\u003c/li\u003e\n\u003cli\u003eYou bring an agile mind-set, you are interested in learning to work with CI/CD, Docker;\u003c/li\u003e\n\u003cli\u003eYou have a proactive, goal-oriented, reliable and self-structured way of working;\u003c/li\u003e\n\u003cli\u003eYou are a team player, are open-minded, and are highly engaged and invested. You love to learn and try-out new technologies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eWhat do we offer?\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eWorking at PwC means working with a range of customers and inspirational colleagues under extensive employment conditions that have been put together with due consideration for your future growth and a flexible approach to work and life. You will be part of a fast growing and high performing team. We invest heavily in our teams and individuals, and help you develop deep specialist capabilities. Most importantly, we offer you the freedom to pursue your passion, and have an impact on the life of others. Some of our key employee benefits include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll be part of an international consulting firm where people are lead by its values and inspired by our purpose;\u003c/li\u003e\n\u003cli\u003eAn open and collaborative working atmosphere, where we encourage everyone to provide and receive feedback;\u003c/li\u003e\n\u003cli\u003eA knowledge-drive organization where you can learn from, and grow into, a top specialist;\u003c/li\u003e\n\u003cli\u003eFlexible working arrangements;\u003c/li\u003e\n\u003cli\u003eYou’ll get great training opportunities;\u003c/li\u003e\n\u003cli\u003eThe opportunity to contribute to Corporate Responsibility, diversity, innovation and / or recruitment;\u003c/li\u003e\n\u003cli\u003eMulticultural team with a strong growth ambition;\u003c/li\u003e\n\u003cli\u003eA lot of coaching and an eye for your personal development;\u003c/li\u003e\n\u003cli\u003eExcellent primary and secondary employment conditions, including Macbook, iPhone;\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eApply now!\u003c/h2\u003e\n\u003cp\u003eAre you interested in this vacancy and do you meet the requirements? Apply directly by clicking the \u003ca href=\"https://vonq.io/2wWdKq8\"\u003ethis link!\u003c/a\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://vonq.io/2wWdKq8\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJDIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50811fc061c474af63e330cecb3816fa715049ff/PWC.jpeg"
    },
    {
      "id": "9c455180-ecca-11e8-886b-ae327644a48e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9c455180-ecca-11e8-886b-ae327644a48e",
      "created_at": "Tue Nov 20 13:52:15 UTC 2018",
      "company": "Huawei",
      "company_url": "https://www.huawei.com",
      "location": "Munich, Germany",
      "title": "Senior Software Engineer (m/f)",
      "description": "\u003cp\u003eHuawei is a leading provider of information and communications solutions. Our products have been deployed in over 140 countries serving more than one third of the world’s population. For the Trusted System Protection (TSP) team within the Cyber Security and Privacy Protection Laboratory (CSPL) in Munich, Germany we are currently looking for a Senior Software Engineer enthusiastic to work on cutting-edge security technologies and to contribute to the security architecture of future Huawei products in a diverse range of verticals, from telecom to cloud and IoT platforms.\u003c/p\u003e\n\u003ch3\u003eYour responsibilities\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and document advanced security technology prototypes for trusted computing, system integrity protection and platform resilience\u003c/li\u003e\n\u003cli\u003eAnalyze product architecture and source code and collaborate with product line engineers to adapt the developed prototypes to product architectures\u003c/li\u003e\n\u003cli\u003eContribute to joint research projects with our European partners from academia and industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOur requirements\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, implementing and debugging embedded firmware and applications in C, for ARMv7/8-A, ARMv7/8-M, other embedded architectures or x86\u003c/li\u003e\n\u003cli\u003eProfessional knowledge in one or more of following areas:\n\u003cul\u003e\n\u003cli\u003eMicrocontroller and application processor architectures, DeviceTree, board bring-up, Secure Boot, flash storage, buses, Secure Update\u003c/li\u003e\n\u003cli\u003eLinux OS kernel internals, memory management, containers, virtualization, security features\u003c/li\u003e\n\u003cli\u003eDevelopment with common security protocols (e.g. TLS, IPSec, OAuth 2.0 etc.), crypto libraries (e.g. OpenSSL, mbedTLS), PKCS#11 or Linux kernel crypto API, X.509 certificates and PKI\u003c/li\u003e\n\u003cli\u003eLinux – network / system tools / command line interface / scripting\u003c/li\u003e\n\u003cli\u003eCode debugging techniques\u003c/li\u003e\n\u003cli\u003eProficiency in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eFollowing are desirable:\n\u003cul\u003e\n\u003cli\u003eTrusted Computing\u003c/li\u003e\n\u003cli\u003eHardware security architectures and best practices\u003c/li\u003e\n\u003cli\u003ePython, Go; Javascript, Node.JS and micro service architectures\u003c/li\u003e\n\u003cli\u003eExperience with cloud technologies such as OpenStack and containers (Docker/Kubernetes)\u003c/li\u003e\n\u003cli\u003eDevOps methodologies such as agile development and continuous delivery\u003c/li\u003e\n\u003cli\u003eExperience in contributing to open-source projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCandidate should be self-motivated to research and compare new software technologies and be in a position to rapidly become accustomed to them in a relatively short period of time.\u003c/p\u003e\n\u003cp\u003eAble to independently design, build, and maintain efficient, reusable and secure code. Identify potential bottlenecks and bugs and devise solutions to the problems. Analyze existing code and identify points of improvement.\u003c/p\u003e\n\u003cp\u003eCapable to analyze complex software architectures and prioritize development tasks to maximize efficiency and output. Able to troubleshoot problems in an existing code base with limited documentation.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease send your CV to \u003ca href=\"mailto:jane.jeffreys@huawei.com\"\u003ejane.jeffreys@huawei.com\u003c/a\u003e.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb8499ec0b8cfed521539de0c702dd3bf1c2b87f/8ed5a22c-7b16-41b0-9320-c538c2717293"
    },
    {
      "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
      "created_at": "Tue Nov 20 12:09:59 UTC 2018",
      "company": "Mindhive",
      "company_url": "http://www.mindhive.org",
      "location": "Brisbane CBD Australia",
      "title": "Senior Front End and Backend Developers",
      "description": "\u003cp\u003e\u003cstrong\u003eMINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMindhive\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.\u003c/p\u003e\n\u003cp\u003eSince completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR BACKEND DEVELOPER ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a backend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eCloud services\nDatabase\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:\u003c/p\u003e\n\u003cp\u003eDevelop cloud-based API services\nDevelop in-house \u0026amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDetailed understanding of cloud architecture(s)\nDetailed knowledge of Python \u0026amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols \u0026amp; certificates\nBonus: detailed knowledge of machine learning \u0026amp; AI\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR FRONTEND DEVELOPER ROLE OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eWeb application\nMobile application\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement UX/UI for mobile first web and mobile apps\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional key responsibilities include:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUtilise any and all relevant frameworks, libraries and techniques:\u003c/p\u003e\n\u003cp\u003eJavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house \u0026amp; third party)\nReview and inform database models are in alignment with frontend view models \u0026amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExperience with current industry design tools (e.g. Figma)\u003c/p\u003e\n\u003cp\u003eUnderstanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking \u0026amp; abstract, technical problem solving\nProactivity\nCollaboration\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:career@mindhive.it\"\u003ecareer@mindhive.it\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
    },
    {
      "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
      "created_at": "Mon Nov 19 20:08:09 UTC 2018",
      "company": "Prezi",
      "company_url": "http://prezi.com",
      "location": "San Francisco ",
      "title": "Senior Full Stack Engineer ",
      "description": "\u003cp\u003ePrezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.\u003c/p\u003e\n\u003cp\u003eTo help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eMake significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRelease early, release often, deploy to production from day one.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCoordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eParticipate in hackathons and engineering days\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearn from and share your knowledge with your team and colleagues on the go.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills and traits we are looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for delivering value to users\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent communication skills, both verbal and written\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficiency with servers, linux, cloud infrastructure, build systems, continuous integration\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA passion for clean, maintainable, well-tested code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience working with applications at scale\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe ability to structure and build complex client side applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of test automation of backend and frontend applications\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtensive knowledge of responsive design, web standards and modern browsers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility and willingness to learn fast and pick up new things easily\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA work environment where people from all backgrounds can thrive and grow\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePeople who listen to your opinions and value them\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to spend time working at our Budapest office\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe opportunity to go to tech conferences anywhere in the world\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFlexible working hours and untracked vacations\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eQuality meals, snacks, drinks every day\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA centrally located office in downtown San Francisco\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e401k plan\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHealth, dental and vision insurance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommuter benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://grnh.se/d5687acb1\"\u003ehttps://grnh.se/d5687acb1\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": null
    },
    {
      "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
      "created_at": "Mon Nov 19 15:44:44 UTC 2018",
      "company": "Aon Cyber Solutions",
      "company_url": "http://www.strozfriedberg.com/careers",
      "location": "NY or LA",
      "title": "Cybersecurity Firm Seeks Senior Developer",
      "description": "\u003cp\u003eAon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.\u003c/p\u003e\n\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePosition Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of this position include but are not limited to the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.\u003c/li\u003e\n\u003cli\u003eServe as a senior developer on multiple product teams.\u003c/li\u003e\n\u003cli\u003eCreate user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.\u003c/li\u003e\n\u003cli\u003eTranslate high-level requirements into working prototypes to generate user feedback and discussion.\u003c/li\u003e\n\u003cli\u003eAdapt and apply cutting edge computer science to highly technical domains.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.\u003c/li\u003e\n\u003cli\u003eMentor other developers.\u003c/li\u003e\n\u003cli\u003eContribute to a positive, collaborative culture for innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineer experience.\u003c/li\u003e\n\u003cli\u003eProficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTTP and REST web services implementation.\u003c/li\u003e\n\u003cli\u003eTest driven development and unit testing frameworks.\u003c/li\u003e\n\u003cli\u003eModern DevOps experience.\u003c/li\u003e\n\u003cli\u003eStandard software engineering tools (git, Jenkins, JIRA).\u003c/li\u003e\n\u003cli\u003eThe proven ability to see things as they should be, and to realize that vision.\u003c/li\u003e\n\u003cli\u003eComfort with agile development and remote team environments.\u003c/li\u003e\n\u003cli\u003eExcellence in verbal and written communication.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003cli\u003ePython 3 and web frameworks such as Django or Flask.\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; relational database modeling.\u003c/li\u003e\n\u003cli\u003eExperience in deployment to AWS, especially serverless technologies.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of JWT and various web security models.\u003c/li\u003e\n\u003cli\u003eD3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).\u003c/li\u003e\n\u003cli\u003eElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.\u003c/li\u003e\n\u003cli\u003eJava 8 and other JVM-based languages.\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and optimization.\u003c/li\u003e\n\u003cli\u003eMobile development using Native or Cross-platform (Xamarin, Ionic, React Native).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": null
    },
    {
      "id": "2744c836-e97b-11e8-8236-5be6ba23f176",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176",
      "created_at": "Fri Nov 16 08:41:52 UTC 2018",
      "company": "Piktochart Sdn Bhd",
      "company_url": null,
      "location": "Europe",
      "title": "DevOps (Remote - Europe)",
      "description": "\u003cp\u003eDear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!\u003c/p\u003e\n\u003cp\u003eYour mission:\u003c/p\u003e\n\u003cp\u003eDesign scalable and secure web infrastructure on GCP \u0026amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting\u003c/p\u003e\n\u003cp\u003eYou offer :\u003c/p\u003e\n\u003cp\u003e3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack\u003c/p\u003e\n\u003cp\u003eExtra points if you have:\u003c/p\u003e\n\u003cp\u003eExperience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations\u003c/p\u003e\n\u003cp\u003eLocation :\u003c/p\u003e\n\u003cp\u003eRemote (Already based in Europe or willing to work in EU timezone)\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply here : \u003ca href=\"https://grnh.se/e0769a2c1\"\u003ehttps://grnh.se/e0769a2c1\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"
    },
    {
      "id": "47328346-e90c-11e8-9429-c09930ae6ec9",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/47328346-e90c-11e8-9429-c09930ae6ec9",
      "created_at": "Thu Nov 15 19:26:24 UTC 2018",
      "company": "Acadian Asset Management",
      "company_url": "http://acadian-asset.com",
      "location": "Boston, MA",
      "title": "Full Stack Developer \u0026 Senior Analyst (Investment Analytics)",
      "description": "\u003cp\u003ePosition Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms\u003c/li\u003e\n\u003cli\u003eEngineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools\u003c/li\u003e\n\u003cli\u003eTeam up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building browser-based applications using JavaScript, CSS, and HTML\u003c/li\u003e\n\u003cli\u003eExperience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent knowledge and technical work experience\u003c/li\u003e\n\u003cli\u003eHands on experience running http server such as Apache / NGINX\u003c/li\u003e\n\u003cli\u003ePrior investment/financial industry knowledge is not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther technologies we use:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSQL, NoSQL, MongoDB, Redis\u003c/li\u003e\n\u003cli\u003eNumpy, Scipy, Pandas\u003c/li\u003e\n\u003cli\u003eD3, AngularJS, Node\u003c/li\u003e\n\u003cli\u003eDocker, Slurm, ZeroMQ, AWS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--703f54fc6dc8eda27790b08f4867a4593f252f09/e875225d-b3cc-454b-9e2f-a7e80cdb65fa"
    },
    {
      "id": "77077cda-e8d4-11e8-8a2f-200c8d1abebd",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/77077cda-e8d4-11e8-8a2f-200c8d1abebd",
      "created_at": "Thu Nov 15 12:46:54 UTC 2018",
      "company": "Centraal bureau voor de statistiek",
      "company_url": null,
      "location": "Den Haag",
      "title": "Software Engineer Information Dialogue",
      "description": "\u003ch2\u003e\u003cstrong\u003eSoftware Engineer Information Dialogue\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eStandplaats\u003c/strong\u003e: Den Haag\u003c/p\u003e\n\u003cp\u003eBreng jij bij het CBS AI tot leven?\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eOver het CBS\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eIn een samenleving waarin informatie explosief toeneemt, is het vrij kunnen beschikken over betrouwbare en integrale data cruciaal. Het CBS levert als hét statistische bureau van Nederland met betrouwbare statistische informatie en data inzicht in maatschappelijke vraagstukken. Daarmee voedt het CBS het maatschappelijk debat, de beleidsontwikkeling en de besluitvorming en draagt zo bij aan welvaart, welzijn en democratie.\u003c/p\u003e\n\u003cp\u003eHet CBS werd in 1899 opgericht vanuit de behoefte aan onafhankelijke, betrouwbare informatie om maatschappelijke vraagstukken te begrijpen. Deze rol heeft het CBS nog altijd. De organisatie is inmiddels uitgegroeid tot een innovatieve kennisorganisatie, die voortdurend nieuwe technologieën en ontwikkelingen toepast om de kwaliteit van de gegevens en de onafhankelijke positie te kunnen blijven borgen.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe werkt aan het ambitieuze innovatieve product Information Dialogue dat alle statistische informatie van het CBS via toepassing van AI ontsluit, zodat een gebruiker precies díe informatie krijgt die hij nodig heeft. Dit doen we door een computergestuurde dialoog, zo menselijk mogelijk, te ontwikkelen die alle informatie die nu in onze open data database beschikbaar is aan te bieden. We zijn het eerste statistiekbureau in de wereld dat deze uitdaging aangaat.\nJe gaat de software ontwikkelen die de verbinding maakt tussen deze open data en de spraakrobot (bijvoorbeeld Google Assistant).\nVoor een impressie waaraan je gaat werken klik hier\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWie zoeken wij\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe bent een Software Engineer met kennis van C#, node.js en Xamarin waarbij kennis van AI-bots zoals Google Dialogflow (Assistent), Cortana, Alexa of Siri een pré is. Vanzelfsprekend kun je user stories opstellen en gemaakte software systematisch testen. Je bent analytisch, creatief, denkt in oplossingen, leert snel, bent een pionier en kan ingewikkelde materie op aansprekende wijze uitleggen aan collega’s die minder van techniek weten. Daarnaast ben je bekend met de principes van Agile en Scrum. Uiteraard heb je uitstekende samenwerkingsvaardigheden.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWaar kom je te werken\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eJe komt te werken in een jong agile team dat verantwoordelijk is voor ontwikkeling van de Information Dialogue, één van de cutting edge innovaties die er voor zorgen dat het CBS tot één van de beste en meest vooruitstrevende statistiekbureaus ter wereld blijft behoren. De sfeer van dit team is die van een Start-up, met hoge ambities, grote uitdagingen en de gedrevenheid om de Information Dialogue tot een succes te maken.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eAanbod\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEen salaris van minimaal €2631 en maximaal €4809 bruto per maand op basis van 36 uur. De inschaling is afhankelijk van kennis en ervaring.\u003c/li\u003e\n\u003cli\u003eEen uitdagende baan in een dynamisch werkveld waar eigen verantwoordelijkheid nemen binnen passende eigen regelruimte voorop staat.\u003c/li\u003e\n\u003cli\u003eEen vaste eindejaarsuitkering van 8,3%.\u003c/li\u003e\n\u003cli\u003eVakantiegeld uitkering van 8%.\u003c/li\u003e\n\u003cli\u003eFlexibele werktijden en thuiswerkmogelijkheden.\u003c/li\u003e\n\u003cli\u003eVoor het woon-werkverkeer ontvang je een NS Businesscard.\u003c/li\u003e\n\u003cli\u003eDe mogelijkheid om bij een fulltime aanstelling (36 uur) 4 uur per week compensatieverlof op te bouwen.\u003c/li\u003e\n\u003cli\u003eEen studiefaciliteitenregeling.\u003c/li\u003e\n\u003cli\u003eIndividuele Keuzen Arbeidsvoorwaarden Pakket; de IKAP-regeling stelt je in staat om bijvoorbeeld extra vakantiedagen te kopen of te sporten met korting door middel van belastingvoordeel.\u003c/li\u003e\n\u003cli\u003eEen werkplek met voldoende ruimte voor jouw persoonlijke en professionele ontwikkeling.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe zijn op zoek naar meerdere software engineers en bieden een tijdelijke aanstelling die na enige tijd kan worden omgezet in een vaste aanstelling.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eContactinformatie\u003c/strong\u003e\nVoor inhoudelijke informatie over de functie kun je contact opnemen met Gabriëlle van Mourik, telefoon 06 52464072.\u003c/p\u003e\n\u003cp\u003eVoor vragen over de procedure kun je contact opnemen met Hilda Folkerts, Corporate recruiter, \u003ca href=\"mailto:h.folkerts@cbs.nl\"\u003eh.folkerts@cbs.nl\u003c/a\u003e, telefoon:070-3375574.\u003c/p\u003e\n\u003cp\u003eDe bevestiging van je sollicitatie wordt mogelijk gezien als spam. Controleer daarom je map ‘ongewenste e-mail’.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003eAlleen sollicitaties via deze link worden in behandeling genomen:\n\u003cstrong\u003e\u003ca href=\"https://cbs.redirect.your-jobresponse.com/software_engineer_information_dialogue_den_haag/236455/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://cbs.redirect.your-jobresponse.com/software_engineer_information_dialogue_den_haag/236455/V819/solliciteren\"\u003eKlik hier om te solliciteren!\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9f323b086b0d7131427118caed32b27ccc8e4bb2/cbac23b1-3b1e-4c28-a8fc-49df1095e6ef"
    },
    {
      "id": "18f5af34-e8c7-11e8-85f6-109da02adff9",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/18f5af34-e8c7-11e8-85f6-109da02adff9",
      "created_at": "Thu Nov 15 11:12:09 UTC 2018",
      "company": "Sterblue",
      "company_url": "https://www.sterblue.com",
      "location": "Remote Job",
      "title": "Lead front-end engineer",
      "description": "\u003cp\u003eLead front-end engineer\n\nJob description\nSterblue builds software for Drones to inspect Wind Turbines and Power Lines automatically using Artificial Intelligence. From automatic 3D navigation around infrastructures to online reports and automatic defect detection, we automate the entire inspection process to help energy and utility companies strive for a cleaner future.\n\nWe are looking for a Senior or Lead web front-end and mobile developer with experience in UI/UX, that will be able to help manage our team operationally and technically. At Sterblue, you will:\u003c/p\u003e\n\n\n\n",
      "how_to_apply": "\u003cp\u003eApply here\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d17ed9dcb168d5f4124e2fab7b976d8f9c27947c/659f247c-8395-473d-956d-ff1c0b1ec3f6"
    },
    {
      "id": "d28b2d1a-e85a-11e8-9b78-62dc829f5516",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d28b2d1a-e85a-11e8-9b78-62dc829f5516",
      "created_at": "Wed Nov 14 22:16:02 UTC 2018",
      "company": "The Atlantic",
      "company_url": "http://theatlantic.com",
      "location": "Washington, DC \u0026 New York, NY",
      "title": "Lead Front End Developer",
      "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. This role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer with proven leadership and management experience.\u003c/p\u003e\n\u003cp\u003eYou are well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits.\u003c/p\u003e\n\u003cp\u003eYour experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow. You know how to evaluate new technology and determine which path will best fit our business needs.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide feedback and mentorship to the front end team through weekly one-on-one check as well as mid and end of the year reviews\u003c/li\u003e\n\u003cli\u003eHelp plan and execute team and individual goals, with an eye on team growth and development\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary while always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eAct as a role model to others on the team by exhibiting strong work ethic and technical expertise when writing code or building new website features\u003c/li\u003e\n\u003cli\u003eAct as a expert who can provide technical help and guidance to the other front end developers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven experience with technical leadership and management\u003c/li\u003e\n\u003cli\u003eExperience architecting a front end codebase at scale\u003c/li\u003e\n\u003cli\u003eStrong technical and non-technical communication skills\u003c/li\u003e\n\u003cli\u003eAble to look at a design and break it into well organized reusable components\u003c/li\u003e\n\u003cli\u003eExperience planning, ticketing, and executing team projects\u003c/li\u003e\n\u003cli\u003eComfortable with Git for version control\u003c/li\u003e\n\u003cli\u003eEffective time management when working on multiple projects\u003c/li\u003e\n\u003cli\u003ePassionate about front end performance with up-to-date knowledge of current techniques\u003c/li\u003e\n\u003cli\u003eFamiliar with Node.js and modern frontend build tooling\u003c/li\u003e\n\u003cli\u003eKnowledgeable about modern JavaScript frameworks but comfortable working in Vanilla JS\u003c/li\u003e\n\u003cli\u003eAble to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and - JavaScript suitable for a complex, fast-changing website\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/em\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/b6ZvfSoePV/Lead-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5696c45ec9ba49ead9190535e55a9e2ca213021/dda99823-bc1b-4669-800b-48e3971f2d37"
    },
    {
      "id": "0e9e93a6-e85a-11e8-8963-f68a643e24dd",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0e9e93a6-e85a-11e8-8963-f68a643e24dd",
      "created_at": "Wed Nov 14 22:11:05 UTC 2018",
      "company": "The Atlantic",
      "company_url": "http://theatlantic.com",
      "location": "Washington, DC \u0026 New York, NY",
      "title": "Senior Front End Developer",
      "description": "\u003cp\u003eThe Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com. We work in a fast-paced, team-oriented environment out of our office in the historic Watergate complex in Washington DC. The role can be based in either Washington, DC or New York, NY.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You Are\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are an experienced developer and solid communicator with an interest in journalism and the media business.\u003c/p\u003e\n\u003cp\u003eYou’re well versed in the modern front-end: ES6, SCSS, understand what makes good markup, and how to best use the capabilities of the browser. You know how to collaborate with designers, are knowledgeable about CSS conventions and naming methodologies such as BEM, SMACSS, OOCSS, and can describe their relative merits. Your experience has taught you the architectural strategies and practices that are necessary for organizing and maintaining front end code that can scale as our team continues to grow.\u003c/p\u003e\n\u003cp\u003eAbove all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eImplement new features for TheAtlantic.com and CityLab.com where they will be viewed by millions of people\u003c/li\u003e\n\u003cli\u003eChampion ways to improve our front end tech stack, including tooling, unit testing, and architecture\u003c/li\u003e\n\u003cli\u003eCollaborate with team members to plan projects, creating technical road maps and breaking projects up into individual tasks as necessary\u003c/li\u003e\n\u003cli\u003eMentor junior developers and act as a subject expert\u003c/li\u003e\n\u003cli\u003eThinks strategically and systematically when planning or coding a project, always keeping in mind long term maintainability\u003c/li\u003e\n\u003cli\u003eWork to continually reduce our front end website load time\u003c/li\u003e\n\u003cli\u003eCommunicate and collaborate with both technical and non-technical members of the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\n-Experience architecting a front end codebase at scale\n-Strong technical and non-technical communication skills\n-Able to write semantic and accessible markup that our growing team can easily maintain and iterate with\n-Able to look at a design and break it into well organized reusable components\n-Comfortable with Git for version control\n-Effective time management when working on multiple projects\n-Passionate about front end performance with up-to-date knowledge of current techniques\n-Familiar with Node.js\n-Knowledgeable about modern JavaScript frameworks but comfortable working in vanilla JS as appropriate\n-Able to provide a code sample demonstrating expertise at writing and organizing CSS, HTML, and JavaScript suitable for a complex, fast-changing website\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEmployees at The Atlantic are entitled to benefits including: 401(k) savings plan with employer match, health care with domestic partner coverage, flexible vacation and sick leave policy, commuter benefits, and rooftop happy hours with one of the best views in DC.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAtlantic Media Values:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAcross Atlantic Media, generally, the firm looks for two “pillar gifts” in you, and everyone else.  In all of us, these are more aspirational than actual, but they are central in our intentions –\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eForce of Ideas\u003c/strong\u003e: At the center of Atlantic Media work are the ideas within our writing. We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual integrity, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSpirit of Generosity\u003c/strong\u003e: Atlantic Media seeks in its ranks those with natural disposition toward service and selfless conduct. Atlantic Media writing should be cut from the same cloth – critical on the merits, but informed by charity and forbearance in measuring motive and personal character.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAtlantic Media is an EOE of Minorities/Women/Vets/Disability.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply online: \u003ca href=\"https://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\"\u003ehttps://atlanticmedia.theresumator.com/apply/EfTMcPw1rG/Senior-Front-End-Developer?source=Github\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d395d665d7dd3f82d64d22e06b39f41ba13e36c9/f749e401-94c5-477e-8c8b-fb68335e240b"
    },
    {
      "id": "96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
      "created_at": "Mon Nov 12 16:56:33 UTC 2018",
      "company": "Bene Studio Ltd.",
      "company_url": "http://www.benestudio.co",
      "location": "Budapest",
      "title": "Senior Full-stack React and Node Engineer - Full Relocation to Budapest",
      "description": "\u003cp\u003eTO BUILD PRODUCTS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewhich are diverse, from healthcare to real estate\u003c/li\u003e\n\u003cli\u003emaking better the lives of the people globally\u003c/li\u003e\n\u003cli\u003ewith the latest JavaScript technologies\u003c/li\u003e\n\u003cli\u003eusing your creativity, empowerment and team player attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO GAIN EXPERIENCE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efrom the varied, 1-6 months long projects\u003c/li\u003e\n\u003cli\u003ewithin the English-speaking, international, growing team of highly skilled engineers,\u003c/li\u003e\n\u003cli\u003ewho passed the famously challenging bene : studio assessment\u003c/li\u003e\n\u003cli\u003eduring the journey of your Professional Development Plan\u003c/li\u003e\n\u003cli\u003ewith the help of your dedicated Mentor\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO REFRESH YOURSELF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eby enjoying the flexible schedule\u003c/li\u003e\n\u003cli\u003erelying on the stable, calculable job and salary\u003c/li\u003e\n\u003cli\u003ein the team which won the Loveable Workplace Prize\u003c/li\u003e\n\u003cli\u003eat the bike, dog and family friendly Office of the Year 2016, where you can have a massage, play ping\npong or drink a coffee/fröccs at the in-house café\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO SHARE YOUR KNOWLEDGE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eas a Mentor within the team\u003c/li\u003e\n\u003cli\u003eat our blog or one of the leading meetups, conferences\u003c/li\u003e\n\u003cli\u003eat bene : studio Workshops!, the most popular cutting-edge tech workshops in Hungary\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RELOCATE\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einto the heart of Europe, to the beautiful, safe and cheap Budapest\u003c/li\u003e\n\u003cli\u003ewith the adaptation guidance, flight ticket, temporary housing and visa services provided by us\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTO RECEIVE FROM US\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea MacBook Pro\u003c/li\u003e\n\u003cli\u003eHUF 450 000 – HUF 710 000 net salary (calculated for full time)\u003c/li\u003e\n\u003cli\u003ewith paid leaves and sick-leaves\u003c/li\u003e\n\u003cli\u003epromotion reflecting the improvement of your skills, experiences and your contribution to the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIF YOU MET THE REQUIREMENTS OF\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in software engineering\u003c/li\u003e\n\u003cli\u003eJavaScript ES6\u003c/li\u003e\n\u003cli\u003eHTML5, CSS3\u003c/li\u003e\n\u003cli\u003eReact.js\u003c/li\u003e\n\u003cli\u003eRedux\u003c/li\u003e\n\u003cli\u003eNode.js\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; noSQL\u003c/li\u003e\n\u003cli\u003eAlgorithms, data structures\u003c/li\u003e\n\u003cli\u003eAWS \u0026amp;/or Azure\u003c/li\u003e\n\u003cli\u003eStrong systems design skills\u003c/li\u003e\n\u003cli\u003eexperienced in all phases of the software development lifecycle\u003c/li\u003e\n\u003cli\u003ebeing the tech lead of one or more projects at a time\u003c/li\u003e\n\u003cli\u003eDeeper knowledge of a CI tool\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOR EVEN GET ADVANTAGES HAVING\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMobile development experience\u003c/li\u003e\n\u003cli\u003eKnowledge of infrastructure as code software tools\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eApply here:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://benestudio.co/joinus/#seniorfullstackengineer\"\u003ehttps://benestudio.co/joinus/#seniorfullstackengineer\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXhnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--451cdbb2938bf00033ff40309db16df3e64d3710/YouTube%20Video%20Thumbnail.png"
    },
    {
      "id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
      "created_at": "Sat Nov 10 02:02:55 UTC 2018",
      "company": "Sesame",
      "company_url": "http://sesamecare.com",
      "location": "New York; Berlin",
      "title": "Software engineer (back end)",
      "description": "\u003cp\u003eWe’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.\u003c/p\u003e\n\u003cp\u003eOur all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.\u003c/p\u003e\n\u003cp\u003eWe believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.\u003c/p\u003e\n\u003cp\u003eWe’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.\u003c/p\u003e\n\u003cp\u003eWe must be on to something, since we’re proud to say:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have engineering teams in New York and Berlin\u003c/li\u003e\n\u003cli\u003eWe've raised millions in funding to grow U.S. operations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWant to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComfortable with Java and microservices.\u003c/li\u003e\n\u003cli\u003eYou seek and prefer simple solutions to complex problems.\u003c/li\u003e\n\u003cli\u003eYou strive to write clean, quality code and enjoy doing it.\u003c/li\u003e\n\u003cli\u003eYou maintain a healthy balance between perfectionism and actually getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.\u003c/li\u003e\n\u003cli\u003eYou love developing software. You have 2+ years of industry experience.\u003c/li\u003e\n\u003cli\u003eYou are a strong team player, have strong writing skills, and enjoy collaborating with others.\u003c/li\u003e\n\u003cli\u003eYou are attuned to the fundamentals of user design and user experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur technology stack includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava 10\u003c/li\u003e\n\u003cli\u003eSpring Boot\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePub/Sub\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eNodeJs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur Offer:\u003c/strong\u003e\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePerks:\u003c/strong\u003e\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.\u003c/p\u003e\n\u003cp\u003eSesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
    },
    {
      "id": "24c31152-e440-11e8-9240-8dede5d34cb0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0",
      "created_at": "Fri Nov 09 16:54:38 UTC 2018",
      "company": "Apple Inc.",
      "company_url": "http://www.apple.com",
      "location": "Cupertino, CA",
      "title": "Full Stack Engineer",
      "description": "\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://apple.com\"\u003ehttp://apple.com\u003c/a\u003e is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.\u003c/p\u003e\n\u003cp\u003eDescription:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability\u003c/p\u003e\n\u003cp\u003eManages expectations and provides ongoing status updates to team members.\u003c/p\u003e\n\u003cp\u003eResponsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.\u003c/p\u003e\n\u003cp\u003eUses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,\u003c/p\u003e\n\u003cp\u003eEnsures robust and lasting solutions are selected and embraced.\u003c/p\u003e\n\u003cp\u003eWorks under tight deadlines and keeps producers updated on an ongoing basis.\u003c/p\u003e\n\u003cp\u003eDevelops positive multi-functional relationships and works well with all levels of management.\u003c/p\u003e\n\u003cp\u003eProvides solutions to complex problems in a concise and articulate way.\u003c/p\u003e\n\u003cp\u003eSeen as the 'go to\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"
    },
    {
      "id": "6087faee-e298-11e8-9e1d-f95949c20e77",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6087faee-e298-11e8-9e1d-f95949c20e77",
      "created_at": "Wed Nov 07 14:22:29 UTC 2018",
      "company": "Attest",
      "company_url": "http://www.askattest.com",
      "location": "London",
      "title": "Engineering Manager",
      "description": "\u003cp\u003eWe’re on the look-out for a seasoned Engineering Manager to lead and empower our team of creative engineers in identifying and delivering features, systems and products they’re proud of. As our first Engineering Manager, this is a greenfield opportunity that will see you having immediate impact from day one. You’ll be trusted to:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAttract top engineering talent.\u003c/strong\u003e You’ll play an integral part in hiring Attest’s engineers by actively sourcing (either via channels such as LinkedIn, relevant events/ meet-ups etc), interviewing, and assessing high-quality candidates for exemplary technical chops, culture-add, potential, and emergent leadership traits.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDevelop our engineers.\u003c/strong\u003e We’ll support you in enabling our team of engineers to deliver their greatest work to date by designing meaningful work that encourages personal and professional growth. You’ll do this by mentoring and coaching them during regular 1:1s, as well as performance and development conversations; embedding continual feedback loops for not only course-correction but praise and acknowledgement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLead our engineering team.\u003c/strong\u003e You’ll dutifully galvanise the engineering team by communicating a clear, exciting mission and purpose that we’re all aligned on. You’ll work closely with our Technology Director to help shape Attest’s engineering strategy, and translate that to the wider engineering team through context and scene-setting; enabling them to autonomously collaborate on finding solutions.\u003c/p\u003e\n\u003cp\u003eYou’ll enable our engineers to ship high-value, high-quality features regularly by acting as a conduit for information by working cross-functionally across departments: always aware of relevant activities in other teams; attending product reviews etc. All the while, you’ll be thinking ahead to ensure we are appropriately structured and adequately resourced to achieve our plans in the near, medium and longer terms.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRetain members of our engineering team.\u003c/strong\u003e You’ll play an integral part in driving a high-performing engineering team by ensuring the its members are engaged in the work they produce and feel their contribution makes a genuine difference not just to the company but our users.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCulture advocate.\u003c/strong\u003e You’ll be trusted to enable the team to identify and solve unique problems. To do this, we need your help in building upon our culture of psychological safety, trust, experimentation, and innovation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA people person with an engineering background with  a passion for working with and developing engineers at different stages of their profession career;\u003c/li\u003e\n\u003cli\u003eAn individual with an incredibly high level of EQ – you’ll be fascinated with learning about people on an ongoing basis. Your role will require you to express compassion and empathy and understanding, as well as work effectively with individuals of varying seniority levels, backgrounds and experiences;\u003c/li\u003e\n\u003cli\u003eApproachable and accessible to all members of the team - a trusted confidant, great listener, and trouble-shooter;\u003c/li\u003e\n\u003cli\u003eAn inspiring communicator with an acute ability to know when to appropriately switch from supportive and encouraging to prescriptive;\u003c/li\u003e\n\u003cli\u003eAbility to manage conflict and devise swift resolution;\u003c/li\u003e\n\u003cli\u003eAdaptable – you’ll be comfortable context-switching multiple times, as there’ll be a variety of tasks and activities you’ll need to effectively and efficiently juggle during the day;\u003c/li\u003e\n\u003cli\u003eEnthusiastic about working in a culture of testing and code review;\u003c/li\u003e\n\u003cli\u003ePassionate about technology, and excited about being hands-on where necessary, but highly motivated about bringing out the best in our engineers by coaching and mentoring them.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperienced building user-centric digital products, with an awareness of complex user interfaces development, distributed systems and technologies across our stack: Java / Go / TypeScript / Node / SQL (Postgres) / AWS\u003c/li\u003e\n\u003cli\u003eYou will have proven leadership skills, with experience line managing a high-performing team\u003c/li\u003e\n\u003cli\u003eCommercial acumen – being able to understand the market and our users as well as the commercial implications and impact our products have on their lives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we’ll offer in return\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA competitive salary that fairly recognises your experience and potential\u003c/li\u003e\n\u003cli\u003eAn equipment budget to spend on the right tools to help you do your best work\n25 days paid holiday – we care about our team’s wellbeing, so getting enough rest to recharge is vital\u003c/li\u003e\n\u003cli\u003eFlexible working hours and working from home\u003c/li\u003e\n\u003cli\u003e£900 Growth \u0026amp; Development budget to spend on the resources and tools that will help you grow in your role\u003c/li\u003e\n\u003cli\u003e10% adventure time to invest in charitable things, or side projects for Attest\u003c/li\u003e\n\u003cli\u003eA values-led working environment that encourages putting people first, honesty, curiosity and leadership\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout our people and culture\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith our team, we take a human-first approach, optimising for joy and adventure (ingrained in everything we do).\u003c/p\u003e\n\u003cp\u003eWe’re a very flat, friendly, non-hierarchical team. You’ll be working with an experienced commercial and technical team that delivers and adapts the Attest platform to continuously evolve and delight every client and every user.\u003c/p\u003e\n\u003cp\u003eWe value putting people (our team, clients and consumers) first; honesty, curiosity, empowerment and leadership are core to our team working style. Decisions are made with careful and quick consideration at Attest, to support fast and efficient growth. You can learn more about Attest on our website.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Attest\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGreat companies put consumers and data at the heart of every decision. Attest makes that simple and open for anyone at every business, continuously, at global scale.\u003c/p\u003e\n\u003cp\u003eWe call it Scalable Intelligence. Through our platform, hundreds of companies of all sizes connect to networks of 100 million consumers across 80 different countries, to learn, grow and innovate better every day.\u003c/p\u003e\n\u003cp\u003eClients like Unilever, Fever-Tree, EE, Publicis and Twitter rely on Attest to learn more about their consumers, markets and competitors. They use Attest to develop new products, test creatives, measure their brand, gain real-time feedback on trends and make better decisions, faster.\u003c/p\u003e\n\u003cp\u003eWe’re backed by leading VCs, including Oxford Capital and Episode 1 (investors behind LoveFilm, Zoopla, Betfair, Shazam, CarWow and many other greats), plus several high-powered amazing Angel investors.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease submit your application via this link: \u003ca href=\"https://team.askattest.com/jobs/139761-engineering-manager\"\u003ehttps://team.askattest.com/jobs/139761-engineering-manager\u003c/a\u003e Feel free to email \u003ca href=\"mailto:careers@askattest.com\"\u003ecareers@askattest.com\u003c/a\u003e if you have any questions.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1pXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3736f7a28b084e631d978b685d41fdff31bad0f/292a96a0-15e6-40fe-b25a-cfe1954fd730"
    },
    {
      "id": "a412770a-e1d3-11e8-8b9f-cf224f66af92",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/a412770a-e1d3-11e8-8b9f-cf224f66af92",
      "created_at": "Tue Nov 06 14:54:06 UTC 2018",
      "company": "moovel Group GmbH",
      "company_url": "https://www.moovel.com/de/DE",
      "location": "Berlin",
      "title": "Backend Engineer (f/m) Node.js",
      "description": "\u003cp\u003eTransit Squad seeks Backend Engineer (f/m)\u003c/p\u003e\n\u003cp\u003eHi,\nwe’re the transit team at moovel. We build services, munch data and process real-time information in all things transit - and we’re looking for a backend engineer in the Berlin office to\njoin us in our effort to provide great public transit APIs as one of the pillars for moovel’s rapidly expanding mobility platform.\u003c/p\u003e\n\u003cp\u003eFIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003cp\u003eHOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions.\u003c/p\u003e\n\u003cp\u003eWith us you’ll use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools\nof their choice and a friendly environment in which they can thrive.\u003c/p\u003e\n\u003cp\u003eSOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it). On the Frontend (IOS, Android and Web) we adopted and embraced Technologies like Swift, Kotlin, Rx or React.\u003c/p\u003e\n\u003cp\u003eBreaking down concrete tasks for this position is not that easy, but that's what makes it so exciting. Here are some things we want to entrust you right away:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou write, monitor, scale and architect microservices that comprise our transit backend\u003c/li\u003e\n\u003cli\u003eYou build infrastructure and tooling for importing data into our data stores\u003c/li\u003e\n\u003cli\u003eYou develop services using Node.js \u0026amp; Python\u003c/li\u003e\n\u003cli\u003eYou perform analysis to enable data driven decisions\u003c/li\u003e\n\u003cli\u003eYou write processing pipelines in Python\u003c/li\u003e\n\u003cli\u003eCollaborate with cross-functional teams to define, design and ship new features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT YOU\nYou should have experience in writing, maintaining \u0026amp; debugging web services. You should be concerned about quality and maintainable code. Some exposure to functional programming, async concepts and micro services would be useful. While having working experience in the Node.js or Python web stack is a plus, it’s not a show-stopper in case you’re flexible and well versed in alternatives like Rails or Play. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud technologies and methodologies like 12 Factor.\u003c/p\u003e\n\u003cp\u003eYou should be familiar with SQL. Additionally, it would be nice if you have experience with any of Elasticsearch, Lucene, Solr or similar search technologies. \u003c/p\u003e\n\u003cp\u003eAs it is our corporate language, you should have good written and verbal communication skills in English.\u003c/p\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eCompany pension plan\u003c/li\u003e\n\u003cli\u003eFree breakfast, coffee \u0026amp; water\u003c/li\u003e\n\u003cli\u003eMobility allowance\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eChild care allowance\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSounds good?\nWe are more than happy to meet you soon! Just click the application form.\u003c/p\u003e\n\u003cp\u003eYour Transit Squad\nMagnus, Engineering Manager Search\u003c/p\u003e\n\u003cp\u003eClick here for the application!\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549073811\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eClick here for the application!\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3516d50eaf556f5817391b6fa7484e24bfe85f1/412aec9a-9ac1-46bd-b50f-c0bbafeb2d09"
    },
    {
      "id": "6bec4df4-e1b2-11e8-90e8-fe865b8dff7c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/6bec4df4-e1b2-11e8-90e8-fe865b8dff7c",
      "created_at": "Tue Nov 06 10:55:50 UTC 2018",
      "company": "51nodes",
      "company_url": "https://www.51nodes.io/jobs",
      "location": "Stuttgart",
      "title": "Softwareentwickler/in Blockchain",
      "description": "\u003cp\u003eDu bist von den Möglichkeiten der Blockchain-Technologie genauso begeistert wie wir? Als leidenschaftlicher Programmierprofi möchtest Du mit Deiner Expertise die revolutionäre Technologie vorantreiben und Kundenanfragen in leistungsstarke Lösungen verwandeln? Du übernimmst gerne Verantwortung für herausfordernde Projekte und hast Lust, zusammen mit einem offenen und motivierten Team in einem flexiblem Arbeitsumfeld produktiv zu sein? Dann sollten wir uns kennenlernen!\u003c/p\u003e\n\u003cp\u003eFür unseren Standort in Stuttgart suchen wir Dich zum nächstmöglichen Zeitpunkt in Vollzeit oder Teilzeit als\u003c/p\u003e\n\u003cp\u003eSoftwareentwickler/in Blockchain\u003c/p\u003e\n\u003cp\u003eDiese spannenden Aufgaben erwarten Dich als Softwareentwickler/in\u0026lt;/b\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFür herausfordernde IT-Projekte mit wirtschaftlicher und gesellschaftlicher Relevanz entwickelst Du verschiedene Blockchain-basierte Lösungskomponenten für Anwendungen\u003c/li\u003e\n\u003cli\u003eAls Spezialist/in für Blockchain-Technologie unterstützt Du unsere Kunden intensiv dabei, die Möglichkeiten der Crypto Economy zu nutzen\u003c/li\u003e\n\u003cli\u003eDu setzt Dich mit aktuellen Trends der Blockchain-Architektur auseinander und bleibst zu Weiterentwicklungen immer up-to-date\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas Du als Softwareentwickler/in mitbringst\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium der Informatik, Elektrotechnik oder Mathematik bzw. eine vergleichbare IT-Ausbildung (z. B. Fachinformatiker/in)\u003c/li\u003e\n\u003cli\u003eEinschlägige Berufserfahrung in allen Phasen der Softwareentwicklung in Kundenprojekten mit Bezug zu WebTechnologien und verteilten Systemen, z. B. Frontend, Backend, Service-Architekturen, Datenintegration und Cloud-Technologien\u003c/li\u003e\n\u003cli\u003eVerhandlungssichere Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003cli\u003eAusgeprägtes Interesse an Blockchain-Technologie und Freude an der selbstständigen Entwicklung von komplexen Softwarelösungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas bieten wir Dir\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEine branchenübliche und leistungsgerechte Vergütung mit erfolgsabhängiger Bonuskomponente\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten in einem modernen, hellen Büro sowie Homeoffice-Möglichkeiten für eine ausgewogene Work-Life-Balance\u003c/li\u003e\n\u003cli\u003eHochwertige IT-Ausstattung mit Hardware Deiner Wahl für optimale Arbeitsbedingungen\u003c/li\u003e\n\u003cli\u003eIntensive Einarbeitung durch unser talentiertes Entwicklerteam\u003c/li\u003e\n\u003cli\u003eIndividuelle Unterstützung beim Erreichen Deiner Entwicklungsziele in einem dynamischen Unternehmen mit flachen Hierarchien\u003c/li\u003e\n\u003cli\u003eDie Möglichkeit, 20% der Arbeitszeit an eigenen Projekten zu arbeiten\u003c/li\u003e\n\u003cli\u003eZentrale Lage mit sehr guter Anbindung an öffentliche Verkehrsmittel (U-Bahn- und S-Bahn-Stationen in unmittelbarer Nähe)\u003c/li\u003e\n\u003cli\u003eDie Teilnahme an Meetups, Mob-Programming, Hackathons im Rahmen unseres Engagements in der lokalen Blockchain-Community\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eÜber 51nodes\n51nodes bietet als Softwareentwicklungsunternehmen die technologische Beratung und Implementierung von Blockchain-basierten Lösungskomponenten. Unser Angebot umfasst Blockchain-Infrastruktur und dezentrale Blockchain-Applikationen, Verknüpfung von IoT / Industrie 4.0 mit Blockchain-Komponenten sowie die Tokenisierung von Assetklassen. Unsere Vision ist es, mit Blockchain-Technologie unsere Kunden zu erfolgreichen Akteuren der Crypto Economy und unsere Mitarbeiter zu aktiven Gestaltern des Internets of Value zu machen.\u003c/p\u003e\n\u003cp\u003eDu möchtest Teil unserer Lösung werden?\nDann bewirb Dich jetzt als „Softwareentwickler/in Blockchain“ und sende uns Deinen CV oder den Link zu einem Deiner Social-Media-Accounts mit der Angabe Deines frühestmöglichen Startdatums über diesen Link!. Wir freuen uns auf Deine Bewerbung!\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!!\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0bd75ddd28da625cdc4a9dc6ef16556973d733fc/4b7788fc-4a2c-4b0b-bac2-5ed87b3b5d59"
    },
    {
      "id": "9636b280-e12a-11e8-819f-7c947fed1ee2",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9636b280-e12a-11e8-819f-7c947fed1ee2",
      "created_at": "Mon Nov 05 20:22:43 UTC 2018",
      "company": "Homestars",
      "company_url": "http://homestars.com",
      "location": "Toronto",
      "title": "Salesforce Engineer ",
      "description": "\u003cp\u003eWHO WE ARE:\nCanadians spend over $70B annually on their homes - whether it’s major renovations, or small repairs and maintenance work. This journey often starts by finding the right contractor. HomeStars is the leading platform in Canada, helping homeowners with their home renovation needs by allowing them to search our database of companies and hundreds of thousands of reviews. Every month over half a million homeowners visit HomeStars to research and connect with the best rated home professionals near them. Home Professionals advertise on HomeStars to tell their story, and grow their business with highly qualified connections. HomeStars has recently been acquired by ANGI Homeservices Inc., the #1 marketplace in the US for helping homeowners connect with the best home service providers.\u003c/p\u003e\n\u003cp\u003eWHY JOIN US:\nHomeStars is looking to continue to build a positive, winning culture and that starts with hiring great people like you! If you are looking to be work or be a part of organization with an exceptional environment, we want to hear from you!\u003c/p\u003e\n\u003cp\u003ePerks of working at HomeStars:\n-We are growing fast. HomeStars is part of the ANGI Homeservices Inc. family.\u003c/p\u003e\n\u003cp\u003e-Excellent Benefits Package. We want a healthy and productive team.\u003c/p\u003e\n\u003cp\u003e-Company wide social events and team building activities.\u003c/p\u003e\n\u003cp\u003e-December Break. The office is closed the week before New Year’s.\u003c/p\u003e\n\u003cp\u003e-Personal Growth. We seek to provide employees with constructive feedback to foster their career growth.\u003c/p\u003e\n\u003cp\u003e-Beautiful brick \u0026amp; beam office in the heart of the entertainment district in Toronto.\u003c/p\u003e\n\u003cp\u003e-Rec room with lounge, ping pong, darts and foosball.\u003c/p\u003e\n\u003cp\u003eABOUT THE ROLE:\nWe are looking for a Salesforce.com Developer who will drive the implementation of Salesforce and its utilization across our organization. The Salesforce Engineer will manage the technical aspects of Salesforce CRM application.\u003c/p\u003e\n\u003cp\u003eTHE OPPORTUNITY:\n-Work in a fast-paced, agile project environment with small, focused teams.\u003c/p\u003e\n\u003cp\u003e-An opportunity to work on a range of platforms such as: Salesforce, Web Applications, Android, iOS.\u003c/p\u003e\n\u003cp\u003e-Gain hands on experience with the latest technologies.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork closely with both the Salesforce and Engineering team at HomeStars.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eResponsible for the technical aspects of Salesforce.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e-Develop custom solutions in VisualForce, Apex, Java, AJAX, and other key technologies.\u003c/p\u003e\n\u003cp\u003e-Develop and maintain Visualforce, Apex, and Integration tools to other third party solutions.\u003c/p\u003e\n\u003cp\u003e-Working closely with the other departments in order to respond to user’s questions and issues.\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS:\n-2-3 years of experience with software development (Java and/or C# preferred).\u003c/p\u003e\n\u003cp\u003e-Ability to organize and prioritize responsibilities effectively in order to meet deadlines\u003c/p\u003e\n\u003cp\u003e-Understanding of multiple programming environments and tools.\u003c/p\u003e\n\u003cp\u003e-Experience with Cloud or Saas solutions.\u003c/p\u003e\n\u003cp\u003e-Knowledge of data management, SQL, SOA design principles.\u003c/p\u003e\n\u003cp\u003e-Understanding of Ruby on Rails, NodeJS, JavaScript,HTML, CSS, and JSON, and exposure to REST based web services.\u003c/p\u003e\n\u003cp\u003e-Understanding of the Salesforce platform (Admin/Config, Apex, VisualForce, Triggers, etc.).\u003c/p\u003e\n\u003cp\u003e-Salesforce experience as a developer or end user.\u003c/p\u003e\n\u003cp\u003eBENEFITS:\nWe are an equal opportunity employer and do not discriminate based upon race, religion, colour, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail resume directly to:\n\u003ca href=\"mailto:jessica.chester@homestars.com\"\u003ejessica.chester@homestars.com\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cda082695a7f08b5567363aa9531c30e29fe648/3de2fb1b-53e9-414f-b371-b04b36617c7d"
    },
    {
      "id": "e10970ae-df31-11e8-8043-db2f2a1252c8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/e10970ae-df31-11e8-8043-db2f2a1252c8",
      "created_at": "Sat Nov 03 06:31:26 UTC 2018",
      "company": "Live Graphic Systems",
      "company_url": "https://www.ligrsystems.com/careers/senior-full-stack-javascript-engineer",
      "location": "Australia and/or Remote",
      "title": "Senior Full-Stack Javascript Engineer",
      "description": "\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eLiGr systems is a growing startup in the sports and media tech industry which creates automated, real-time data-driven graphic displays (scoreboards, team lists, infographics) for sports organisations from grassroots to professional for use primarily over live video broadcasts.\u003c/p\u003e\n\u003cp\u003eWho we're looking for:\u003c/p\u003e\n\u003cp\u003eThis is a unique opportunity to build exciting, bleeding edge technology in the sports and broadcast industry, and we are looking for a talented, experienced javascript/web engineer to join our team and help build on our ideas.\u003c/p\u003e\n\u003cp\u003eThe successful applicant will be able to assist us in meeting the challenges of scale as we expand our operation internationally. You will have an immediate opportunity to influence the product strategy and organisational culture.\u003c/p\u003e\n\u003cp\u003eSuccessful candidates will be invited to meet our leadership team in person or over video chat.\u003c/p\u003e\n\u003cp\u003eThe following skills are required\u003c/p\u003e\n\u003cp\u003eStrong engineering ability,\nFluent / Advanced English,\nExcellent practical problem-solving,\nA passion for software,\nGreat written communication skills,\nOrganisational skills,\nContinuous Learner,\nAbility to work unsupervised\u003c/p\u003e\n\u003cp\u003eThe following skills are highly valued\u003c/p\u003e\n\u003cp\u003eCloud infrastructure e.g. containers(docker), Kubernetes, GCP, cloud functions,\nReact, webpack, babel, redux\nSvg, gsap, animation/motion graphics\nEvent-driven architectures, event sourcing,\nTesting unit/integration/e2e/CI/CD,\nUnderstanding of design systems,\nCSS\u003c/p\u003e\n\u003cp\u003eThe following is also valued\u003c/p\u003e\n\u003cp\u003eSome understanding of sport,\nVideo streaming - encoding/hls/rtmp/storage/facebook/youtube\u003c/p\u003e\n\u003cp\u003eOur current stack:\u003c/p\u003e\n\u003cp\u003eReact,\nNode.js,\nDocker,\nKubernetes,\nGCP,\nGoogle Firestore\u003c/p\u003e\n\u003cp\u003eWhat you”ll be doing\u003c/p\u003e\n\u003cp\u003eCreating web interfaces/content management systems,\nImplementing graphic components,\nImproving event-driven architecture and building backend services\u003c/p\u003e\n\u003cp\u003eBenefits of the role\u003c/p\u003e\n\u003cp\u003eIn addition to being a part of a great team, working in a fun and creative environment and learning from the best technical minds in the sports industry, we offer:\u003c/p\u003e\n\u003cp\u003eCompetitive salary,\nAccess to the latest tools and technologies,\nWork with global sporting bodies and sports leagues,\nRemote work with a virtual and regular communication environment (Trello, Slack, Github etc),\nStart-up sized company, where you can make an immediate impact,\nBuild software that will have a global impact on sports and the future of sports broadcast,\nOur team is technical and understands developer needs\u003c/p\u003e\n\u003cp\u003eApply\u003c/p\u003e\n\u003cp\u003eApplying is easy. Send an email with your resume, website, Github account, links to apps or anything else you're proud of. If we like what we see, we’ll get in touch and organise a catchup in person or over video chat. We’ll then tell you more about the role and we can decide if there's a fit.\u003c/p\u003e\n\u003cp\u003eEmail applications to \u003ca href=\"mailto:luke@ligrsystems.com\"\u003eluke@ligrsystems.com\u003c/a\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail \u003ca href=\"mailto:luke@ligrsystems.com\"\u003eluke@ligrsystems.com\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f0edf89d5fad53a1a86e8ac0472360882eb11af/b1bdfcc7-18e7-4394-83e2-0f539fb92289"
    },
    {
      "id": "2d215050-dea2-11e8-9a31-2431d393de1e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/2d215050-dea2-11e8-9a31-2431d393de1e",
      "created_at": "Fri Nov 02 13:22:25 UTC 2018",
      "company": "Aera Technology",
      "company_url": "https://www.aeratechnology.com/careers",
      "location": "Bucharest",
      "title": "Senior User Interface Software Engineer",
      "description": "\u003cp\u003eDo you want to shape the future of enterprise software?\u003c/p\u003e\n\u003cp\u003eAt Aera Technology, we apply Internet scale technology to the challenges facing enterprise businesses. Think of the self-driving car: connected, always-on, thinking, and autonomous. Our mission is to enable companies in the same way.\u003c/p\u003e\n\u003cp\u003eWe're hiring exceptionally talented UI developers to join our top-notch engineering team. This is a great opportunity to be part of a team developing cutting-edge enterprise cloud platform. You must be highly motivated, independent, result oriented and enjoy working in a start-up atmosphere.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop new features and components in our existing web application.\u003c/li\u003e\n\u003cli\u003eBuild reusable code and libraries for future use.\u003c/li\u003e\n\u003cli\u003eWork with PM and UX designer to understand the requirement and ensure the technical feasibility of UI/UX design.\u003c/li\u003e\n\u003cli\u003eOptimize application for maximum speed and scalability.\u003c/li\u003e\n\u003cli\u003eLearn and research latest JavaScript frameworks and work on PoC projects to integrate and upgrade existing application.\u003c/li\u003e\n\u003cli\u003eCollaborate with other team members and with cross-functional teams and stakeholders across geographies.\u003c/li\u003e\n\u003cli\u003eCreate and execute unit test cases and contribute to test automation.\u003c/li\u003e\n\u003cli\u003eParticipate in design and code reviews.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA passion for UI/UX\u003c/li\u003e\n\u003cli\u003eYou are an experienced UI developer with a proven track record of delivering great software.\u003c/li\u003e\n\u003cli\u003eExperience with HTML, CSS, HTML5, OO Javascript, modern frameworks such as ReactJS, Polymer, VueJS or ExtJS/Sencha.\u003c/li\u003e\n\u003cli\u003eExperience with NodeJS, Browserify, Babelify, Gulp, Bower.\u003c/li\u003e\n\u003cli\u003eAn ability to write code for responsive UI and implement common widgets.\u003c/li\u003e\n\u003cli\u003eHave a passion for quality and writing clean, solid, readable code that scales and performs well.\u003c/li\u003e\n\u003cli\u003eA firm grasp of Computer Science fundamentals including object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.\u003c/li\u003e\n\u003cli\u003eExperience with Java, Rest API is a big plus.\u003c/li\u003e\n\u003cli\u003eExperience with cloud services. Experience with microservices would be a bonus.\u003c/li\u003e\n\u003cli\u003eAn urge to collaborate with other architects, designers, product managers, and software developers to influence product direction and functional requirements.\u003c/li\u003e\n\u003cli\u003eAbility to coach and collaborate inside and outside the team - You enjoy working closely with others, teaching, and learning, and are comfortable showing off your work.\u003c/li\u003e\n\u003cli\u003eHave a positive energy and enthusiasm - cultural fit is a big deal for us, we’re looking for smart people who are excited about solving big problems and are self-motivated to get things done.\u003c/li\u003e\n\u003cli\u003eAre highly organized and have a professional attitude towards work - You're an exceptional communicator, you are pragmatic, and you know how to build trust.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Aera, we're on a mission to solve the biggest, most intractable challenges of enterprise software. We envision the rise of the Self-Driving Enterprise: a more autonomously functioning business with a central operating system that connects and orchestrates business operations. Our platform is increasingly used by the world's largest companies to identify and respond to market opportunities faster.\u003c/p\u003e\n\u003cp\u003eIf you share our passion for building the next generation of enterprise software and implementing it for the most sophisticated customers in the world, you’ve met your match. Headquartered in Mountain View, California, we're growing fast, with teams in Mountain View and San Francisco (California), Portland (Oregon), Bucharest and Cluj-Napoca (Romania), Paris (France), Munich (Germany), London (UK), Pune (India), and Sydney (Australia).  So join us, and let’s build this!\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eApply here: \u003ca href=\"https://bit.ly/2Jx6mmO\"\u003ehttps://bit.ly/2Jx6mmO\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE5XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--05413e1280c79b2290bac2120cb451141c7922b6/d676ca56-df82-4c76-8f5e-bd7778190625"
    },
    {
      "id": "d5955556-de1b-11e8-97e2-45ff61609ad8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/d5955556-de1b-11e8-97e2-45ff61609ad8",
      "created_at": "Thu Nov 01 21:20:36 UTC 2018",
      "company": "PlayVS",
      "company_url": "http://www.playvs.com",
      "location": "Santa Monica, CA",
      "title": "Software Engineer, Full Stack",
      "description": "\u003cp\u003ePlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.\u003c/p\u003e\n\u003cp\u003eAs an engineer, you’ll be expected to do the normal tech startup duties including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWriting clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDebugging, documentation, and unit testing. Everyone loves a smooth game day.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave a natural knack for user experience and pixel-perfect design. You should know CSS like it’s the back of your hand, and be extremely comfortable building modern responsive web apps.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBeing flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines. You will wear many hats here.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImproving our internal tooling and engineering process by contributing your knowledge and unique background.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we’re looking for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years of technical experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterest in gaming or esports, though no prior experience is required\nExperience using NodeJS or NoSQL data stores like Redis, RethinkDB or Mongo\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExpert developing interfaces using ReactJS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTop-notch CSS skills\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eComfortable working with WebSockets\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDegree in Computer Science preferred\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant. This role is $110K+.  If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail us at \u003ca href=\"mailto:careers@playvs.com\"\u003ecareers@playvs.com\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2xXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--02900ed15126cfa0983ebd48ddba2b07539f4c62/7f3abee5-837b-49da-93f7-b44fbe23fc0a"
    },
    {
      "id": "0a9333c4-71da-11e0-9ac7-692793c00b45",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45",
      "created_at": "Thu Nov 01 13:09:37 UTC 2018",
      "company": "Jane Street",
      "company_url": "http://janestreet.com",
      "location": "New York, NY; London, UK; Hong Kong",
      "title": "Software Developer (Functional Programming)",
      "description": "\u003cp\u003eSoftware Developer\u003c/p\u003e\n\u003cp\u003eJane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.\u003c/p\u003e\n\u003cp\u003eThe markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.\u003c/p\u003e\n\u003cp\u003eWe are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.\u003c/p\u003e\n\u003cp\u003eThe atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.\u003c/p\u003e\n\u003cp\u003eYou can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (\u003ca href=\"http://ocaml.janestreet.com/?q=node/61\"\u003ehttp://ocaml.janestreet.com/?q=node/61\u003c/a\u003e), and our programming blog (\u003ca href=\"http://ocaml.janestreet.com\"\u003ehttp://ocaml.janestreet.com\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWe also have extensive benefits, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e90% book reimbursement for work-related books\u003c/li\u003e\n\u003cli\u003e90% tuition reimbursement for continuing education\u003c/li\u003e\n\u003cli\u003eExcellent, zero-premium medical and dental insurance\u003c/li\u003e\n\u003cli\u003eFree lunch delivered daily from a selection of restaurants\u003c/li\u003e\n\u003cli\u003eCatered breakfasts and fresh brewed Peet's coffee\u003c/li\u003e\n\u003cli\u003eAn on-site, private gym in New York with towel service\u003c/li\u003e\n\u003cli\u003eKitchens fully stocked with a variety of snack choices\u003c/li\u003e\n\u003cli\u003eFull company 401(k) match up to 6% of salary, vests immediately\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMore information at \u003ca href=\"http://janestreet.com/culture/benefits/\"\u003ehttp://janestreet.com/culture/benefits/\u003c/a\u003e\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease apply through our web app form at  \u003ca href=\"https://www.janestreet.com/join-jane-street/apply/\"\u003ehttps://www.janestreet.com/join-jane-street/apply/\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f6dec9502d27094bbc9c7ff6c33806d0cdbb6faf/ac79023f-6a10-488b-be9f-751264dd8d06"
    },
    {
      "id": "597d15fc-dda9-11e8-8d8c-9919a5047170",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/597d15fc-dda9-11e8-8d8c-9919a5047170",
      "created_at": "Thu Nov 01 07:40:23 UTC 2018",
      "company": "Shiftling",
      "company_url": null,
      "location": "remote",
      "title": "Full Stack Developer ",
      "description": "\u003cp\u003eLooking for an awesome full-stack web developer with experience on both Node.js and React technologies.\u003c/p\u003e\n\u003cp\u003eThe role requires a product-focused, self-driven engineer who takes pride in delivering a quality application, and also cares about all the details that will make our users happier.\u003c/p\u003e\n\u003cp\u003eRequired technical skills:\nNode.js (ability to build a quality backend application that will power-up all web/mobile clients)\nPostgreSQL (use as primary database from the backend application)\nReact (ability to build a modern web application using the React ecosystem)\nCSS (ability to produce a responsive website from given designs)\nGit / GitHub (working with git and GitHub flow)\nContinuous-Integration (CI) (ability to setup and use any CI platform of choice for automated testing and deployments)\nDevops: be familiar with at least one of Heroku, AWS, Google Cloud, Azure.\u003c/p\u003e\n\u003cp\u003eNice to have technical skills:\nGraphQL (ability to build a GraphQL API on the backend, as well as consume it on the React web client)\nExperience on integrating with 3rd party payment APIs\u003c/p\u003e\n\u003cp\u003eOther required skills:\nFluent in English (both written and verbal)\nExperienced on working remotely in a fast-paced environment\u003c/p\u003e\n\u003cp\u003eConditions:\nEngagement: full-time (40hr / week), long-term\nLocation: remote, minimum overlap of 4 working hrs with Gulf Standard Time (GST).\nCompensation: negotiable, plus stock options\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:bella@shiftling.com\"\u003ebella@shiftling.com\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1JXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31ea7282927da02f0d01e5ecf9a7a08ba1bf4864/29a56b2b-08c7-43fe-a2b1-b64ed771d13c"
    },
    {
      "id": "adfadaec-dd63-11e8-859f-cbc9965a7cd1",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/adfadaec-dd63-11e8-859f-cbc9965a7cd1",
      "created_at": "Wed Oct 31 23:21:52 UTC 2018",
      "company": "Game Closure",
      "company_url": "https://www.gameclosure.com",
      "location": "Tokyo // Mountain View // Eugene",
      "title": "Systems Engineer",
      "description": "\u003cp\u003eGame Closure is on the hunt for Systems Engineers to help us build the social games that guide the development of our mobile game engine. We are a 70 ­strong and growing team with offices in Mountain View, California, Oregon and Tokyo, Japan. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eAs a Systems Engineer at Game Closure, you will play a pivotal role in creating a platform to revolutionize the mobile game development industry. Our engineers are generally amazing at something and great at everything else. We write cross-­compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js \u0026amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003eThe Role:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team.\u003c/li\u003e\n\u003cli\u003ePlay a critical role in day-­to-­day coding, performance profiling, optimization, and general troubleshooting.\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.\u003c/li\u003e\n\u003cli\u003eArchitect and code sophisticated client/server systems for mobile gaming.\u003c/li\u003e\n\u003cli\u003eLearn from and mentor other engineers on your team.\u003c/li\u003e\n\u003cli\u003eTake ownership of your projects to make them the best they can possibly be.\u003c/li\u003e\n\u003cli\u003eProvide valuable input on the company's long-term engineering roadmap and help identify areas of opportunity for improvement.\u003c/li\u003e\n\u003cli\u003eDefine the cutting edge of social gaming!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience.\u003c/li\u003e\n\u003cli\u003eExperience writing clean, testable, high­-quality code with a special focus on mobile performance.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games.\u003c/li\u003e\n\u003cli\u003eAbility to interact with peers in a constructive and productive style.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn, or other VCS.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eBoth Android and iOS game development experience\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eAPPLY HERE\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a58c79dfaea2375731d403d9d9f6a1e95f5d3407/0e7a7952-d150-4ac5-b78f-1cd813de1d40"
    },
    {
      "id": "041ee91a-dd62-11e8-9c45-21fe88164ff0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/041ee91a-dd62-11e8-9c45-21fe88164ff0",
      "created_at": "Wed Oct 31 23:11:37 UTC 2018",
      "company": "Game Closure",
      "company_url": "https://www.gameclosure.com",
      "location": "Tokyo // Mountain View // Eugene",
      "title": "Game Engineer (HTML5)",
      "description": "\u003cp\u003eGame Closure is on the hunt for Game Engineers to help us build the social games that guide the development of our mobile game engine. We are a 60 ­strong and growing team with offices in Mountain View, California; Eugene, Oregon, and Tokyo, Japan. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass mobile games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js \u0026amp; Python back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003eThe Role:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user! Insist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eWe expect you to be good at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eYou must be pretty knowledgeable with what jQuery can do, and what functionality you are better off custom coding.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­ oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with 3rd party SDKs, analytics, and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf ­starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eBoth Android and iOS game development experience\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eAPPLY HERE\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ebd7c63eaa45634e45c75fc9422d2133fc002c0/df5f52c6-ee20-4a9c-b9c9-a18e6785f918"
    },
    {
      "id": "1ef41916-dd5f-11e8-98aa-d336cb7192b8",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/1ef41916-dd5f-11e8-98aa-d336cb7192b8",
      "created_at": "Wed Oct 31 22:54:08 UTC 2018",
      "company": "playvs-inc",
      "company_url": null,
      "location": "Santa Monica, CA",
      "title": "Software Engineer, Backend",
      "description": "\u003cp\u003ePlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.\u003c/p\u003e\n\u003cp\u003eAs an engineer, you’ll be expected to do the normal tech startup duties including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWriting clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDebugging, documentation, and unit testing. Everyone loves a smooth game day.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBuilding and integrating APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBeing flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eImproving our internal tooling and engineering process by contributing your knowledge and unique background.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we’re looking for:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e4+ years of technical experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterest in gaming or esports\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience using NodeJS or NoSQL data stores like Redis, RethinkDB or Mongo\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eComfortable working with WebSockets\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDegree in Computer Science preferred\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant. This role is 90k and up. If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease email us at \u003ca href=\"mailto:careers@playvs.com\"\u003ecareers@playvs.com\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13c421e8ce9526b4489d8262c8e069636a4a6285/967eb69a-ee1a-490c-b2cc-8ea54070fc36"
    },
    {
      "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
      "created_at": "Wed Oct 31 19:45:06 UTC 2018",
      "company": "Traction",
      "company_url": "https://www.tractionco.com/",
      "location": "Sunnyvale, CA ",
      "title": "Lead Full Stack Developer",
      "description": "\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": null
    },
    {
      "id": "dfa47394-dd33-11e8-96a4-acacdfc6a86d",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/dfa47394-dd33-11e8-96a4-acacdfc6a86d",
      "created_at": "Wed Oct 31 17:40:00 UTC 2018",
      "company": "MetaCommunications, Inc.",
      "company_url": null,
      "location": "Iowa City, Iowa",
      "title": "Senior Software Engineer (Frontend)",
      "description": "\u003cp\u003eMetaCommunications, Inc. is looking for an experienced and passionate Senior Software Engineer (Frontend) to provide software engineering leadership and support using cutting edge technologies to support growing client needs. Join a team of developers to build scalable, full stack Cloud–based offerings. Keep up–to–date with technical trends in the industry and evangelize the adoption of new technologies in solution architectures. Maintain responsibility for personal and team goals, give adequate direction to junior developers, and perform peer code reviews. Work extensively with business analysts and UX engineers to deliver world class solutions for clients.\u003c/p\u003e\n\u003cp\u003eOur Technology Stack:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReact / Redux.\u003c/li\u003e\n\u003cli\u003eJSON Schema / JSON Rules Engine / JSON Schema Forms.\u003c/li\u003e\n\u003cli\u003eTypeScript.\u003c/li\u003e\n\u003cli\u003eJest.\u003c/li\u003e\n\u003cli\u003eES 6 Decorators, Async/ Await.\u003c/li\u003e\n\u003cli\u003eMaterial UI, Bootstrap, Foundation, Styled Components.\u003c/li\u003e\n\u003cli\u003eWebpack.\u003c/li\u003e\n\u003cli\u003eDocker / Kubernetes / Kafka / Elasticsearch.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJob Description:\u003c/p\u003e\n\u003cp\u003eMetaCommunications is looking for a talented Frontend Engineer to join our team. We are looking for someone with strong JavaScript skills and a passion for developing solutions that impact Fortune 500 Companies on a daily basis. We are a tight knit team that is focused on providing excellent service to our customers.\u003c/p\u003e\n\u003cp\u003eIndividuals who succeed in this position are exceptional at sharing information, enthusiastic, learn quickly and seek opportunities for developing themselves and the team around them. We're looking for someone who isn't scared of the unknown and likes pushing the envelope. No day will look the same, but you will always be expected to rise to the occasion and overcome challenges.\u003c/p\u003e\n\u003cp\u003eJoin our team and you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with a high-performing team to deliver solutions for some of the world’s top brands\u003c/li\u003e\n\u003cli\u003eDevelop new user-facing features using React.js\u003c/li\u003e\n\u003cli\u003eTranslate designs and wireframes into high quality code\u003c/li\u003e\n\u003cli\u003eOptimize components for maximum performance\u003c/li\u003e\n\u003cli\u003eGrow in your knowledge of business processes as you see how some of the world’s top brands operate their creative and marketing teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNeed to have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of experience with JavaScript\u003c/li\u003e\n\u003cli\u003e2+ years of experience with software development\u003c/li\u003e\n\u003cli\u003e1+ years of experience with React.js and Redux\u003c/li\u003e\n\u003cli\u003eExperience with REST or JavaScript\u003c/li\u003e\n\u003cli\u003eExperience with Agile development methods, including TDD, CI, or automated testing\u003c/li\u003e\n\u003cli\u003eGit, Gitflow, d Experience using a version control system, such as git, mercurial, perforce\u003c/li\u003e\n\u003cli\u003eBA or BS degree\u003c/li\u003e\n\u003cli\u003eExperience with CSS pre–processor, including LESS or SASS\u003c/li\u003e\n\u003cli\u003eExperience with server-side technologies-Node.js, .Net Core\u003c/li\u003e\n\u003cli\u003eExperience with issue tracking and change control tools, Team Services, YouTrack, or Jira\u003c/li\u003e\n\u003cli\u003eExperience with building and consuming REST APIs\u003c/li\u003e\n\u003cli\u003eExperience with relational database systems, including PostgreSQL, SQL Server, or MySQL\u003c/li\u003e\n\u003cli\u003eExperience with technical document writing\u003c/li\u003e\n\u003cli\u003eKnowledge of IaaS Cloud hosting solutions, including AWS or Azure\u003c/li\u003e\n\u003cli\u003ePossession of excellent oral and written communication skills\u003c/li\u003e\n\u003cli\u003eKnowledge of web technologies\u003c/li\u003e\n\u003cli\u003eExperience with relational databases and T-SQL\u003c/li\u003e\n\u003cli\u003eExperience working with a team of developers on software applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow to apply:\n\u003ca href=\"https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\"\u003ehttps://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eCompany Statement:\u003c/p\u003e\n\u003cp\u003eMetaCommunications is a leader in providing innovative project management software for the world’s best creative teams. Our mission is simple: to build great products that make the best creative teams as productive as possible.\u003c/p\u003e\n\u003cp\u003eOur Perks/Benefits:\nWe're a fun team. We build awesome products, solve hard problems and keep a good life balance. Our culture is one of our biggest strengths. In our company, people treat each other with respect and compassion, and together cultivate a culture of teamwork, learning, accountability, and fun. There’s a commitment to understanding the whole person, helping to create a shared, unquestioning environment.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical/Dental Insurance\u003c/li\u003e\n\u003cli\u003e401K\u003c/li\u003e\n\u003cli\u003eGenerous PTO, including both maternal and paternal paid time off\u003c/li\u003e\n\u003cli\u003eOptimal workspace in the heart of downtown Iowa City\u003c/li\u003e\n\u003cli\u003e$20/month local gym membership within walking distance\u003c/li\u003e\n\u003cli\u003eFlexible work environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy work at Meta? We LOVE...\nOur customers:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbility to work directly with our customers, many of whom are Fortune 500 companies.\u003c/li\u003e\n\u003cli\u003eOpportunity to see the software through the customer lens.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur people:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe are passionate about what we do.\u003c/li\u003e\n\u003cli\u003eWe collaborate to identify solutions to problems.\u003c/li\u003e\n\u003cli\u003eWe challenge each other to be better.\u003c/li\u003e\n\u003cli\u003eContinuous learners.\u003c/li\u003e\n\u003cli\u003eA great mix of cultures and backgrounds.\u003c/li\u003e\n\u003cli\u003eWe hang out outside of work hours.\u003c/li\u003e\n\u003cli\u003eTalented colleagues who want to solve customer issues using an innovative technology.\u003c/li\u003e\n\u003cli\u003ePeople and talent-oriented leadership.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur products:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExciting technology.\u003c/li\u003e\n\u003cli\u003eEnvironment allows you to quickly learn how software is developed, deployed and maintained.\u003c/li\u003e\n\u003cli\u003eFast-paced environment with new challenges at every turn.\u003c/li\u003e\n\u003cli\u003eOpportunities to learn and grow into new roles.\u003c/li\u003e\n\u003cli\u003eDramatically improve the work experience for our customers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur workspace:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLocated in the heart of beautiful downtown Iowa City, only steps from the best eateries.\u003c/li\u003e\n\u003cli\u003eGreat view of the Ped Mall.\u003c/li\u003e\n\u003cli\u003eNatural light everywhere!\u003c/li\u003e\n\u003cli\u003eFarmer’s Market Wednesday.\u003c/li\u003e\n\u003cli\u003eInside bike racks\u003c/li\u003e\n\u003cli\u003eFree downtown parking\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout MetaCommunications:\nMetaCommunications develops workflow and collaborative productivity solutions that help marketing, creative design, packaging teams and enables workgroups around the world be more productive.\u003c/p\u003e\n\u003cp\u003eOur mission is to bring to market new innovative brands, products and approaches to help marketing teams improve creativity, performance and output that delivers dramatic growth and created value for their organization. Our vision is to be a global leader in innovative management solutions that allow people to collaborate, communicate and deliver anytime, anywhere, with speed and simplicity.\u003c/p\u003e\n\u003cp\u003eMeta’s team members are collaborative, driven, hungry, fearless problem solvers, flexible and uniquely talented. We find new ways to continually improve our products and services with convenience, security, and reliability for the customer as our key goals. Our culture is people-oriented, with continuous learning is at its core. Our main office is located in downtown Iowa City, IA.\u003c/p\u003e\n\u003cp\u003eAs a customer-obsessed organization focused on creating win-win relationships, there are many exciting reasons to join the Meta team. We provide competitive salaries, quality healthcare and an enjoyable office environment. We are deeply mission and vision driven and support flexible schedules when needed.\u003c/p\u003e\n\u003cp\u003eMetaCommunications has a dynamic, fast-paced, and entrepreneurial environment, which requires a professional, flexible, self-starter orientation. We believe in hiring the best, the brightest, and cultivating a culture of collaboration and appreciation. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, creed, color, religion, sex, sexual orientation, gender identity, national origin, marital status, citizen status, age, disability, military or protected veteran status, genetic predisposition or carrier status or any other legally protected status.\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\"\u003ehttps://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c6aeed882da03478723a4bbc3bc1ccd2df767b97/97e6e5d2-60e1-49e5-a5a1-a41e960f00be"
    },
    {
      "id": "ec37b682-d902-11e8-9f44-b572cb1c6642",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/ec37b682-d902-11e8-9f44-b572cb1c6642",
      "created_at": "Fri Oct 26 09:40:08 UTC 2018",
      "company": "ProntoPro",
      "company_url": "http://www.prontopro.it",
      "location": "Milan, Italy",
      "title": "Frontend Software Engineer ",
      "description": "\u003cp\u003eNOI\u003c/p\u003e\n\u003cp\u003eProntoPro.it è il portale dei professionisti N. 1 in Italia. Aiutiamo milioni di clienti a trovare il professionista di cui hanno bisogno: dal fotografo per il matrimonio, all’idraulico, all’insegnante di chitarra. Stiamo portando meritocrazia e trasparenza in un mercato finora opaco; vogliamo trasformare sia il modo in cui gli italiani scelgono un professionista sia quello in cui i professionisti trovano clienti.\u003c/p\u003e\n\u003cp\u003eSiamo una startup in grandissima crescita: a marzo 2015 eravamo 2 persone, oggi siamo più di 100. 29 anni è l'età media, lavoriamo in open space, e riduciamo al minimo la burocrazia (perchè è semplicemente controproducente), ognuno ha grandi responsabilità e impatta direttamente sul nostro successo.\u003c/p\u003e\n\u003cp\u003eAbbiamo investitori istituzionali del calibro di Immobiliare.it, e angel investor di alto profilo, che lavorano in Google, Facebook, eBay, McKinsey e Unicredit: non abbiamo più i rischi tipici di una startup. Nel 2017 abbiamo avviato il processo di internazionalizzazione conquistando anche il mercato di Austria e Svizzera, e non é finita qua...\u003c/p\u003e\n\u003cp\u003eCerchiamo persone che vogliano costruire un colosso nel mondo del digital italiano che impatti fortemente la vita di tutti noi. Non è un lavoro tranquillo – ci mettiamo il cuore.\u003c/p\u003e\n\u003cp\u003eIL TUO RUOLO\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProntoPro cambierà il modo in cui i clienti trovano i professionisti. Avrai piena visibilità sul business, non solo sulla tua area. Ci si aspetta quindi che tu apporti valore anche a livello architetturale, a livello di prodotto e a livello strategico, senza limitarti ad eseguire ciò che è esplicitamente richiesto.\u003c/li\u003e\n\u003cli\u003eSarai parte del team Technology, oggi composto da 15 (+) persone e che arriverà a 25 entro fine 2018.\u003c/li\u003e\n\u003cli\u003eCreerai un prodotto scalabile che sosterrà la fase di hyper-growth dell'azienda.\u003c/li\u003e\n\u003cli\u003eLavorerai in un ambiente particolarmente attento ai trend tecnologici emergenti e alle metodologie di lavoro agile. In ProntoPro utilizziamo PHP, Symfony, Node.js, SASS, ReactJS, MySQL, AuroraDB, Redis, MongoDB, RabbitMQ, Solr, New Relic, Kubernetes, Docker, Ansible, Git, Drone.io. L’iniziativa personale nell’arricchire/modificare lo stack è un tema a cui siamo molto sensibili, pertanto ci aspettiamo il tuo contributo.\u003c/li\u003e\n\u003cli\u003eParteciperai ad eventi di settore ed avrai la possibilità di raccontare come in ProntoPro abbiamo affrontato e vinto sfide tecnologiche.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTU\u003c/p\u003e\n\u003cp\u003eStiamo cercando un Software Engineer che voglia unirsi al nostro team Technology.\u003c/p\u003e\n\u003cp\u003eCi aspettiamo che tu abbia una solida esperienza in:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJavascript, CSS, SASS, SCSS, manipolazione DOM e JS object model\u003c/li\u003e\n\u003cli\u003eScrivere codice pulito, mantenibile, scalabile e aderente ai principi SOLID\u003c/li\u003e\n\u003cli\u003eAssicurare test coverage del codice prodotto\u003c/li\u003e\n\u003cli\u003eAstrarre il codice prodotto costruendo componenti e librerie riutilizzabili\u003c/li\u003e\n\u003cli\u003eOttimizzare i componenti creati per ottenere massime performances sull'intera gamma di device/browser supportati\u003c/li\u003e\n\u003cli\u003eUtilizzare (e quando necessario creare da zero) client e librerie per consumare servizi REST\u003c/li\u003e\n\u003cli\u003eUtilizzare strumenti di sviluppo e build (Babel, Webpack, NPM, …)\u003c/li\u003e\n\u003cli\u003eRevisionare le pull requests dei tuoi colleghi\u003c/li\u003e\n\u003cli\u003eLavorare in pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReactJS, Redux e isomorphic React\u003c/li\u003e\n\u003cli\u003eWebSocket\u003c/li\u003e\n\u003cli\u003eLibrerie di data structuring (es. immutable.js)\u003c/li\u003e\n\u003cli\u003ePattern di autenticazione (OAuth2, JWT, …)\u003c/li\u003e\n\u003cli\u003eCreare e gestire applicazioni ed ambienti basati su Docker\u003c/li\u003e\n\u003cli\u003ePipeline di continuous integration/delivery in ambienti come Jenkins e Drone.io\u003c/li\u003e\n\u003cli\u003eConoscenza di altri linguaggi di programmazione (PHP, Python, Ruby, …)\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eSimply send us an email with your CV to \u003ca href=\"mailto:peopleops@prontopro.it\"\u003epeopleops@prontopro.it\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOR apply easily on our website:\n\u003ca href=\"https://prontopro.recruiterbox.com/jobs/fk0hzbs/\"\u003ehttps://prontopro.recruiterbox.com/jobs/fk0hzbs/\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dcb2d0e46779aae0236b5ce387f65d7a47a55e73/3d97c575-b7f8-4490-a39a-36785dbe6744"
    },
    {
      "id": "9bd2d6fa-d7ee-11e8-9f5e-c14b0048f133",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9bd2d6fa-d7ee-11e8-9f5e-c14b0048f133",
      "created_at": "Thu Oct 25 00:41:02 UTC 2018",
      "company": "Hello Design",
      "company_url": "https://www.hellodesign.com",
      "location": "Los Angeles, CA",
      "title": "Full Stack Developer",
      "description": "\u003cp\u003eHello is looking for a Full Stack Developer to help us make the future. Build award-winning interactive systems and collaborate with multi-disciplinary teams consisting of strategists, designers, and fellow programmers. We are looking for technologists who are passionate about their craft and have a drive for discovery and innovation.\u003c/p\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCan solve a problem in two ways\u003c/li\u003e\n\u003cli\u003eQuickly learn new languages and software\u003c/li\u003e\n\u003cli\u003eMaster of the MVC and MVVC design pattern\u003c/li\u003e\n\u003cli\u003eExpert in PHP, Python, and/or Node.js\u003c/li\u003e\n\u003cli\u003eExperienced in schemaless databases such as Mongo, Couch, Dynamo\u003c/li\u003e\n\u003cli\u003eCan work with multiple content management systems and speak to their strategies, advantages, and disadvantages\u003c/li\u003e\n\u003cli\u003eKnowledgeable with caching systems such as Redis, Memcache\u003c/li\u003e\n\u003cli\u003eFamiliar with AWS products such as EC2, ElastiCache, ECS, CloudFront, SQS, Elastic Transcoder, SNS\u003c/li\u003e\n\u003cli\u003eHave a working knowledge of JS Frameworks such as Backbone, Ember or AngularJS\u003c/li\u003e\n\u003cli\u003eComfortable working in a Linux environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAttributes\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDetailed and organized\u003c/li\u003e\n\u003cli\u003eExcellent communicator, written an verbal\u003c/li\u003e\n\u003cli\u003eAble to manage multiple projects simultaneously\u003c/li\u003e\n\u003cli\u003eResponsible and capable of meeting tight deadlines\u003c/li\u003e\n\u003cli\u003eEnjoy working in a collaborative environment\u003c/li\u003e\n\u003cli\u003ePassion for quality design and innovation\u003c/li\u003e\n\u003cli\u003eA thirst for learning\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHello is a creative agency driven to craft worthy experiences. We believe everything will be digital—surrounding us like the air we breathe. Our clients include Facebook, Nike, Tillamook, Sonos, Murad, and Supercell. Our work: hellodesign.com\u003c/p\u003e\n\u003cp\u003eWe offer competitive salary, 100% employer paid health and dental, 401(k) match, paid vacation, holidays including winter break, gym discounts, fully stocked snack rack, freshly ground coffee, and really cute dogs\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003ePlease apply using \u003ca href=\"https://www.linkedin.com/jobs/view/932516853\"\u003eLinkedIn\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOnly qualified applicants will be called for an interview. Please no phone calls or office visits.\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7389dcbcfe7092331d653cc1f0caa3a5dca2e329/f9c740fb-f104-4833-a38b-d53bdd3930c5"
    },
    {
      "id": "0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0b0b5ff2-d7c1-11e8-88ec-ba50e54bd4a0",
      "created_at": "Wed Oct 24 19:14:53 UTC 2018",
      "company": "Stride Consulting",
      "company_url": "https://www.stridenyc.com/",
      "location": "New York, New York",
      "title": "Software Engineer",
      "description": "\u003cp\u003eStride Consulting is a mission-driven, engineering-centric company. We seek developers who place a high value on continuous learning, and value diversity. If you consider yourself a non-dogmatic engineer, have a thirst for learning, and an eye for process, you’ll be in great company.\u003c/p\u003e\n\u003cp\u003eOur goal is to leave our client teams functioning at a higher level than when we found them.  We do this by writing high quality code alongside our clients’ development teams, as well as mentoring their developers, product teams and stakeholders in software development best practices.\u003c/p\u003e\n\u003cp\u003eWe believe that practices like Test Driven Development, Pairing and Refactoring are the foundation of a high functioning software team. And, we believe that not all Agile practices provide equal value to all teams at all times. So, we approach each engagement as the unique opportunity it is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs a Strider, you’ll find a learning opportunity that’s unmatched. You will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe part of an engineering-driven culture, one that has a 4.9 star Glassdoor review and has won Crain’s -Best Places to Work 2 years in a row.\u003c/li\u003e\n\u003cli\u003eWrite high quality code with some of the smartest engineers in town.\u003c/li\u003e\n\u003cli\u003eImmerse yourself in a learning journey that’s second to none. No where else will you find the variety that being a consultant brings, all a subway ride away.\u003c/li\u003e\n\u003cli\u003eMentor and be mentored. Learning weaves a thread through all that we do.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA Day In The Life of a Stride Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll co-locate and work onsite at your client (all are in NYC). We are proud to call the most outstanding tech teams in NYC our clients, ranging from funded startups to Fortune 500.\u003c/p\u003e\n\u003cp\u003eYou are empowered to define what work/life balance means to you. Every day for every Strider is different. Here’s how one day might unfold:\u003c/p\u003e\n\u003cp\u003e9am: One-on-one with my manager. We grab coffee at Stumptown and talk about my career goals. I’m noodling on a complex React story and I get my manager’s take. We walk away with action items for next week’s one-on-one.\u003c/p\u003e\n\u003cp\u003e10am: Daily Standup. I’m at work at the client’s office. They’ve got a really cool setup with dual monitors and nice pairing stations. I’m on a team of 4 Striders and 4 client developers. Our Product Manager kicks off the Standup. It lasts about 10 minutes and then we’re off to code.\u003c/p\u003e\n\u003cp\u003e10:10-12:00 Pair Programming. I’m pairing with another Strider. We continue working on the React story from the day before. We have questions for the Product Manager that we ask via Slack.\u003c/p\u003e\n\u003cp\u003e12:00-12:30 Travel to Stride\u003c/p\u003e\n\u003cp\u003e12:30-1:30 Lunch-n-Learn. Today, Stride’s got a Lunch-n-Learn on Terraform Cloud that I’m psyched about. Stacey, one of our senior engineers, is leading the session. We hold Lunch-n-Learns every few weeks and I go to about half of them.\u003c/p\u003e\n\u003cp\u003e1:30-1:45 Travel back to the client’s office.\u003c/p\u003e\n\u003cp\u003e1:45-2:45 Retrospective. Retrospectives on my team are amazing. Today we’re retrospecting our last release. I’ve never facilitated a retrospective before, but my goal is to facilitate one this June. We have a nice rhythm and walk away with action items and confidence in the path ahead.\u003c/p\u003e\n\u003cp\u003e2:45-6 Pair Programming. I get in a few more hours of coding. This afternoon, my pair is Amy, a junior dev who works for the client. I love mentoring and am really excited to have this time to mentor Amy. I’ve been coding about 3 years myself, so at first the idea of mentoring someone else gave me imposter syndrome, but the Stride approach is fluid and allows for flexibility and it’s been a huge career learning experience for me.\u003c/p\u003e\n\u003cp\u003e6pm: Leave for the Day. It’s been a good day, I throw on my headphones as I head to the subway.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be doing\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWriting high quality code, and bringing a ‘teach a team to fish’ mentality to your project.\u003c/li\u003e\n\u003cli\u003eEmbed with development teams in some of NYC’s most exciting companies to help them up their game and get stuff done.\u003c/li\u003e\n\u003cli\u003eAdvocate for non-dogmatic Agile software development best practices like Test Driven Development (TDD), Pair Programming, Collective Code Ownership, Continuous Deployment, and Continuous Improvement.\u003c/li\u003e\n\u003cli\u003eBe part of a cross functional team that includes Striders (likely 2-6 Strider engineers plus a product manager) and client employees (likely engineers and other tech roles).\u003c/li\u003e\n\u003cli\u003eWork with a variety of tech stacks, and a see a variety of tech teams. We embed with teams who write code in modern tech stacks such as Ruby on Rails, React, Angular, Python, Scala, Java8, Elixir, Node and more.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou’re a fit for Stride if you have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of software development experience\u003c/li\u003e\n\u003cli\u003eExperience in multiple programming languages\u003c/li\u003e\n\u003cli\u003eExcitement to learn new languages and frameworks\u003c/li\u003e\n\u003cli\u003eExperience with TDD, story estimation, test writing, and pair programming\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect from us:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous learning on things that you are passionate about\u003c/li\u003e\n\u003cli\u003eCompetitive Pay and Benefits (including Profit Sharing!)\u003c/li\u003e\n\u003cli\u003eEmpowerment to work at a self-defined Sustainable Pace\u003c/li\u003e\n\u003cli\u003eNo travel, all of our clients are located in NYC\u003c/li\u003e\n\u003cli\u003e$2,000 and up to two weeks of your time for self-directed professional development\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003eFollow this link and submit your application!\n\u003ca href=\"https://grnh.se/48e351b21\"\u003ehttps://grnh.se/48e351b21\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1519dc6ab4f7ab9dd26e999a6547bd915811998/c960e5e4-ab0b-4f84-ab8e-2554b72a8f66"
    },
    {
      "id": "df5b47be-d612-11e8-88f4-50633736745c",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/df5b47be-d612-11e8-88f4-50633736745c",
      "created_at": "Mon Oct 22 15:56:13 UTC 2018",
      "company": "Constructive",
      "company_url": "http://www.constructive.co",
      "location": "New York City",
      "title": "Technology Team Lead, Design Agency for Social Impact",
      "description": "\u003cp\u003eConstructive (\u003ca href=\"https://constructive.co\"\u003ehttps://constructive.co\u003c/a\u003e), a leading brand experience design \u0026amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.\u003c/p\u003e\n\u003cp\u003eIf you’re an experienced technologist who wants to work on websites and products that are at the front of the field, knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.\u003c/p\u003e\n\u003cp\u003e##A bit about the role\nOur Technology Team Lead needs a holistic understanding of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.\u003c/p\u003e\n\u003cp\u003eThat’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.\u003c/p\u003e\n\u003cp\u003e##A bit about us\nWe’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office, so there’s music and joking mixed-in with being heads-down on work.\u003c/p\u003e\n\u003cp\u003e##A bit about diversity\nWe believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.\u003c/p\u003e\n\u003cp\u003e##What we need you to do extremely well\nThis role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eProvide strong technical leadership\u003c/strong\u003e—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eGuide development team\u003c/strong\u003e and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meets expectations.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWork with stakeholders to define strategic goals\u003c/strong\u003e and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eDevelop requirements, specifications, and architecture\u003c/strong\u003e to document what we’re building and what’s been built.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLead development of ambitious digital products,\u003c/strong\u003e serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBe a hands-on developer\u003c/strong\u003e who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eReview code and provide feedback\u003c/strong\u003e on work done by other developers; oversee the UAT and QA processes in coordination with project managers.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eImprove best practices, recommend tools, and build frameworks\u003c/strong\u003e that make our work more efficient, effective, and technically front-of field.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBe the face of Constructive’s technical expertise\u003c/strong\u003e throughout client engagements, in the development community, and when needed in our sales cycle.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eContribute to developing proposals and estimates\u003c/strong\u003e for technical projects, particularly those with complex requirements.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLead vetting and hiring of web developers\u003c/strong\u003e and external development partners.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBe a team player\u003c/strong\u003e who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eIt definitely helps if you also have a good sense of humor\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e##Expertise that’s important in our work\nRight now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert Wordpress \u0026amp; Drupal development (Minimum 5 years of experience)\u003c/li\u003e\n\u003cli\u003eExpert front-end development experience\u003c/li\u003e\n\u003cli\u003eStrong experience with Webpack / Gulp / SCSS\u003c/li\u003e\n\u003cli\u003eStrong experience doing large-scale content migrations\u003c/li\u003e\n\u003cli\u003eStrong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)\u003c/li\u003e\n\u003cli\u003eExperience with Data Visualization (D3, Highcharts)\u003c/li\u003e\n\u003cli\u003eExperience with Infrastructure, System Administration \u0026amp; DevOps\u003c/li\u003e\n\u003cli\u003eExperience with ES6, Node, React\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e##What’s in it for you?\nWork/Life balance matters at Constructive, and we do our best to make sure everyone is well-taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Added to your base salary, here’s what we have on tap for 2018-2019 to add:\u003c/p\u003e\n\u003cp\u003e##Benefits \u0026amp; Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompany-Sponsored Health, Dental \u0026amp; Vision Insurance\u003c/li\u003e\n\u003cli\u003e401K plan with 4% company match\u003c/li\u003e\n\u003cli\u003eAnnual profit sharing bonus (Approx 10% of company profit distributed equally)\u003c/li\u003e\n\u003cli\u003eDiscretionary performance-based bonuses\u003c/li\u003e\n\u003cli\u003e2 weeks paid vacation (+1 additional day per year)\u003c/li\u003e\n\u003cli\u003ePaid vacation between Christmas \u0026amp; New Year’s\u003c/li\u003e\n\u003cli\u003e1/2-day Summer Fridays (Approx 16)\u003c/li\u003e\n\u003cli\u003e1 week paid personal/sick days\u003c/li\u003e\n\u003cli\u003eUnlimited work-from-home days (within reason!) after 6 months\u003c/li\u003e\n\u003cli\u003eMonthly \u0026amp; Annual employee-voted \"shout-out\" gift card awards\u003c/li\u003e\n\u003cli\u003eTransitChek (pay for transit w/ pre-tax $)\u003c/li\u003e\n\u003cli\u003eDiscounted Company Cell Phone Plan\u003c/li\u003e\n\u003cli\u003e$1K annual professional development stipend\u003c/li\u003e\n\u003cli\u003eNew client bonus (2.5% of largest contract in year 1 for any non-inbound client)\u003c/li\u003e\n\u003cli\u003eCompany lunch every Wednesday\u003c/li\u003e\n\u003cli\u003eWeekly Happy Hr (every non-summer Friday)\u003c/li\u003e\n\u003cli\u003eCoffee, healthy snacks, soda\u003c/li\u003e\n\u003cli\u003eBi-monthly Company Events (sporting events, bowling, holiday party, etc)\u003c/li\u003e\n\u003cli\u003eThe feeling of satisfaction knowing that your work is helping make the world a better place\u003c/li\u003e\n\u003c/ul\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003cstrong\u003eInterested? Great! Then please send an email to titled “Technology Team Lead” to \u003ca href=\"mailto:jobs@constructive.co\"\u003ejobs@constructive.co\u003c/a\u003e with the following\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e• A resume\u003c/li\u003e\n\u003cli\u003e• A cover letter telling us a bit about you and what excites you about joining our team\u003c/li\u003e\n\u003cli\u003e• Links to your own website, websites you’ve worked on, github, whatever\u003c/li\u003e\n\u003cli\u003e• Desired salary (freelance rate for those interested in consulting with us)\u003c/li\u003e\n\u003c/ul\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHhYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3235bba838d5ca1495e8b2f6b73a0e54ee613498/caadf965-8957-438b-b2f8-12af175c8721"
    },
    {
      "id": "c37e8b54-d555-11e8-8730-c2f34a443e55",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/c37e8b54-d555-11e8-8730-c2f34a443e55",
      "created_at": "Sun Oct 21 17:25:33 UTC 2018",
      "company": "DevsData",
      "company_url": null,
      "location": "Oslo, Norway",
      "title": "Senior Full-Stack JavaScript Engineer/Tech Lead with Node, React \u0026 TypeScript",
      "description": "\u003ch2\u003e[Senior Full-Stack JS Engineer/Tech Lead with Node \u0026amp; React needed!]\u003c/h2\u003e\n\u003cp\u003eJoin the team of ex-Googlers!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull-time (40h a week)\u003c/li\u003e\n\u003cli\u003eLocation: Oslo, Norway (relocation required)\u003c/li\u003e\n\u003cli\u003e$70 - $140 an hour\u003c/li\u003e\n\u003cli\u003eDuration: 12+ months (permanent employment / long-term contract)\u003c/li\u003e\n\u003cli\u003eStart: beginning of December 2018 (negotiable)\u003c/li\u003e\n\u003cli\u003e3-4 people with this profile are needed\u003c/li\u003e\n\u003cli\u003eAccommodation cost in Oslo is covered by the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYet another time we search for extraordinary specialists to join our nerdy crew! :)\u003c/p\u003e\n\u003cp\u003eProject for a big retail corporation in Norway (12k employees) with stores across entire Europe.\u003c/p\u003e\n\u003cp\u003eYou’ll be working closely with business people (including ex-McKinsey partner with 20 years of business experience; Harvard graduate), IT specialists (SE architects, DevOps, UI/UX people), marketing/sales department, Machine Learning/Artificial Intelligence professionals, QA, logistics department and product manager to design, prioritize, and build new IT products in fashion, retail/e-commerce sectors related to a digital transformation that is happening in the organization.\u003c/p\u003e\n\u003cp\u003eOne of the most important products that will need to be build is a new ecommerce platform (think: Zalando competitor) as well as information/data exchange platform for physical stores and IT tools for supply chain optimisation.\u003c/p\u003e\n\u003cp\u003eThe role is a fast-paced environment that involves above-average degree of tech \u0026amp; business conceptual thinking, swiftness, communication \u0026amp; people skills and ecommerce/retail understanding. Ideal candidate can present a work history for well-known brands, some startup world experience (we’re lean and move quickly), min 2 years of similar commercial experience on a similar position.\u003c/p\u003e\n\u003cp\u003eIf you are looking for an easy next project/job, or quick cash - there are better offers out there.\u003c/p\u003e\n\u003cp\u003eBasic algorithmic experience and problem solving absolutely required - if you're strong in JS/React, but struggle at algo or data structures, don't bother applying.\u003c/p\u003e\n\u003cp\u003eA rare, exciting opportunity to hone industry-related, practical business know-how, system design skills and work/network with top-notch world-class professionals (we already relocated people from the US and Canada for this project; people with Harvard and Google on their CVs).\u003c/p\u003e\n\u003cp\u003eInitial tech stack (likely to be refined, but not totally changes):\n️- Front-End: JS, TypeScript, React, Vue, MobX.js, Redux, Web Assembly, Sharing components, PWA, Jest, Mocha, Karma\n️- Back-End: mainly - NodeJS and serverless, but also: GoLang, Python, grpc, RabbitMQ, Celery, Redis, Nginx*, HAProxy, Varnish HTTP cache\n️- DevOps: Kubernetes, Ansible, Docker, Prometheus, Grafana, ELK, Fluentd, Collectd, Terraform, Helm, New Relic, Sentry, secret management tools, InfluxDB, Telegraf, Swagger*\n️- FaaS: OpenFaas, Serverless, AWS Lambda*, Fission, Syncano\u003c/p\u003e\n\u003cp\u003eThe most important are: JS, TypeScript, React \u0026amp; Node\u003c/p\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cp\u003e️- Previous involvement in building large IT product totally from scratch\u003c/p\u003e\n\u003cp\u003e️- Wide-range of technologies that you're comfortable using (ideally covering majority of tools mentioned in this offer, and especially strong in JS environments including Node and React)\u003c/p\u003e\n\u003cp\u003e️- Minimum 1 year of professional experience on commercial projects and similar position (tech lead / senior FE/JS engineer)\u003c/p\u003e\n\u003cp\u003e️- Minimum 7 years of commercial, hands-on IT experience in total\u003c/p\u003e\n\u003cp\u003e️- International experience\u003c/p\u003e\n\u003cp\u003e️- Fluent English communication skills\u003c/p\u003e\n\u003cp\u003e️- Being up to date with recent tech tools \u0026amp; frameworks, extensive overall IT knowledge\u003c/p\u003e\n\u003cp\u003e️- Willingness to relocate to Oslo\u003c/p\u003e\n\u003cp\u003eBig pluses:\u003c/p\u003e\n\u003cp\u003e️- Studied Computer Science at a prestigious university - e.g. Harvard, Oxford, Cambridge, MIT, Stanford, Wharton, Berkeley (or top universities in your country)\u003c/p\u003e\n\u003cp\u003e️- Worked or contracted to well-know brands and corporations e.g. Google, Palantir, Hedge Funds, Amazon, eBay, Microsoft, Goldman Sachs (joking, GS is actually a minus :)), Intel, Nvidia\u003c/p\u003e\n\u003cp\u003e️- Work experience also from the fast-paced startup world\u003c/p\u003e\n\u003cp\u003e️- Worked with a distributed/remote team before\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExcellent communication skills\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBusiness understanding / product skills\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e️- If you consider yourself a nerd :) and are passionate about the technology, that's a big plus\u003c/p\u003e\n",
      "how_to_apply": "\u003cp\u003e\u003ca href=\"mailto:tomasz@potanski.pl\"\u003etomasz@potanski.pl\u003c/a\u003e\u003c/p\u003e\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0f39a1718b69f374b4decee135d579c6b376e4f4/24236f93-1354-4eef-9265-ef08a743ba6b"
    }
  ]
}
